[
  {
    "text": "[Required] Bachelor's degree of Information Technology or higher Have working experience and excellent knowledge at software developing using Java, Spring boot Have working experience and excellent knowledge at software developing using React, HTML, JavaScript Good knowledge about AI (Azure OpenAI and GenAI) Good knowledge about public cloud (Azure, AWS,) Database: MariaDB (or MySQL).",
    "entities": [
      [
        142,
        146,
        "SKILL"
      ],
      [
        148,
        159,
        "SKILL"
      ],
      [
        237,
        242,
        "SKILL"
      ],
      [
        244,
        248,
        "SKILL"
      ],
      [
        250,
        260,
        "SKILL"
      ],
      [
        282,
        284,
        "SKILL"
      ],
      [
        286,
        291,
        "SKILL"
      ],
      [
        292,
        298,
        "SKILL"
      ],
      [
        303,
        308,
        "SKILL"
      ],
      [
        345,
        350,
        "SKILL"
      ],
      [
        352,
        355,
        "SKILL"
      ],
      [
        368,
        375,
        "SKILL"
      ],
      [
        380,
        385,
        "SKILL"
      ]
    ]
  },
  {
    "text": "[Preferred] Having experience with Python and Google cloud",
    "entities": [
      [
        35,
        41,
        "SKILL"
      ],
      [
        46,
        58,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm phát triển ứng dụng mobile app sử dụng lập trình React Native.",
    "entities": [
      [
        64,
        69,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có hiểu biết về kiến trúc ứng dụng IoT trong smart home, smart building phục vụ phát triển app cho hệ thống.",
    "entities": [
      [
        35,
        38,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Sử dụng Tiếng Anh tốt là một lợi thế.",
    "entities": [
      [
        8,
        17,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Có kinh nghiệm làm việc với C#, .NET Core Framework, Entity Framework; (biết abp.io là một lợi thế) - Có kinh nghiệm về phân tích thiết kế database SQL và NoSQL (ưu tiên PostgreSQL và MongoDB); - Có kinh nghiệm làm việc với MicroService (biết Docker và AWS EC2 là một lợi thế) - Có kiến thức cơ bản về ELK Stack; - Biết sử dụng Git, GitFlow, phương pháp làm việc Agile/Scrum; - Có khả năng tự phân tích và giải quyết vấn đề; - Đọc hiểu và nghiên cứu tài liệu Tiếng Anh; - Chủ động và trách nhiệm trong công việc.",
    "entities": [
      [
        172,
        182,
        "SKILL"
      ],
      [
        186,
        193,
        "SKILL"
      ],
      [
        226,
        238,
        "SKILL"
      ],
      [
        245,
        251,
        "SKILL"
      ],
      [
        255,
        258,
        "SKILL"
      ],
      [
        304,
        313,
        "SKILL"
      ],
      [
        330,
        333,
        "SKILL"
      ],
      [
        335,
        342,
        "SKILL"
      ],
      [
        365,
        370,
        "SKILL"
      ],
      [
        461,
        470,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kỹ năng & Kinh nghiệm: Có kinh nghiệm với Python, JavaScript, TypeScript Thành thạo framework ReactJS, VueJS, Next.js, Node.js, FastAPI Hiểu biết về Genetive AI và các mô hình ngôn ngữ lớn (LLM) là lợi thế Đọc hiểu tài liệu Tiếng Anh, có thể giao tiếp cơ bản Tính cách & Tư duy: Chủ động trong công việc Tư duy logic, khả năng làm việc độc lập và teamwork tốt",
    "entities": [
      [
        42,
        48,
        "SKILL"
      ],
      [
        50,
        60,
        "SKILL"
      ],
      [
        62,
        72,
        "SKILL"
      ],
      [
        110,
        117,
        "SKILL"
      ],
      [
        119,
        126,
        "SKILL"
      ],
      [
        128,
        135,
        "SKILL"
      ],
      [
        158,
        160,
        "SKILL"
      ],
      [
        224,
        233,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Tốt nghiệp Đại học trở lên ngành Công nghệ thông tin, Phần mềm, Kỹ thuật máy tính, Điện tử viễn thông - Có từ 2 năm kinh nghiệm trở lên tại vị trí tương đương - Đọc hiểu Tiếng Anh cơ bản, có thể nghiên cứu tài liệu bằng ngoại ngữ là một lợi thế - Hiểu biết tốt về các quy trình phát triển phần mềm.",
    "entities": [
      [
        172,
        181,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Hiểu biết tốt về mô hình ứng dụng Microservices và Monolithic Services - Hiểu biết và có kinh nghiệm quản trị hệ điều hành Linux - Có kinh nghiệm lập trình ứng dụng các ngôn ngữ Java, .NET, C#, Golang, JS - Có kinh nghiệm quản trị ứng dụng trên nền tảng Docker, Container là một lợi thế - Có kinh nghiệm làm phân tích nghiệp vụ là một lợi thế - Có kinh nghiệm trong triển khai và quản lý hệ thống CI/CD (Continuous Integration/Continuous Deployment), bao gồm việc sử dụng các công cụ như Jenkins, GitLab CI/CD, hoặc các công cụ tương tự khác.",
    "entities": [
      [
        125,
        130,
        "SKILL"
      ],
      [
        180,
        184,
        "SKILL"
      ],
      [
        196,
        202,
        "SKILL"
      ],
      [
        256,
        262,
        "SKILL"
      ],
      [
        399,
        404,
        "SKILL"
      ],
      [
        490,
        497,
        "SKILL"
      ],
      [
        506,
        511,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Sử dụng thành thạo Git, nắm bắt tốt Git Flow - Sử dụng thành thạo các phần mềm như Ansible, Terraform, Jenkins, ArgoCD ...",
    "entities": [
      [
        21,
        24,
        "SKILL"
      ],
      [
        38,
        41,
        "SKILL"
      ],
      [
        85,
        92,
        "SKILL"
      ],
      [
        94,
        103,
        "SKILL"
      ],
      [
        105,
        112,
        "SKILL"
      ],
      [
        114,
        120,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Có khả năng ứng dụng AI và công nghệ mới vào công việc",
    "entities": [
      [
        23,
        25,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kiến thức cơ bản về Linux và networking (cấu trúc OS, TCP/IP, DNS, SSH...).",
    "entities": [
      [
        23,
        28,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Biết sử dụng Docker và có khái niệm về Kubernetes.",
    "entities": [
      [
        13,
        19,
        "SKILL"
      ],
      [
        39,
        49,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có hiểu biết về Git, CI/CD là lợi thế.",
    "entities": [
      [
        16,
        19,
        "SKILL"
      ],
      [
        21,
        26,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có hiểu biết về triển khai Ansbile là lợi thế Biết một trong các ngôn ngữ: Python, Go, hoặc Shell script là lợi thế.",
    "entities": [
      [
        75,
        81,
        "SKILL"
      ],
      [
        83,
        85,
        "SKILL"
      ],
      [
        92,
        97,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Biết về database (MySQL/PostgreSQL/Redis...) là điểm cộng.",
    "entities": [
      [
        18,
        23,
        "SKILL"
      ],
      [
        24,
        34,
        "SKILL"
      ],
      [
        35,
        40,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có 7 năm kinh nghiệm phát triển phần mềm, trong đó có ít nhất 2 năm kinh nghiệm với React Native tại các ngân hàng, tài chính .",
    "entities": [
      [
        84,
        89,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm Lead team ít nhất 2 năm, hiểu biết về quản lý dự án Agile/Scrum.",
    "entities": [
      [
        67,
        72,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Thành thạo JavaScript, TypeScript, React Native, Redux, Redux-Saga, React-Query.",
    "entities": [
      [
        11,
        21,
        "SKILL"
      ],
      [
        23,
        33,
        "SKILL"
      ],
      [
        35,
        40,
        "SKILL"
      ],
      [
        68,
        73,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Hiểu biết về Clean Architecture, Microservices, API Gateway, GraphQL, gRPC là một lợi thế.",
    "entities": [
      [
        61,
        68,
        "SKILL"
      ],
      [
        70,
        74,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm làm việc với các công cụ CI/CD, Docker, Kubernetes.",
    "entities": [
      [
        40,
        45,
        "SKILL"
      ],
      [
        47,
        53,
        "SKILL"
      ],
      [
        55,
        65,
        "SKILL"
      ]
    ]
  },
  {
    "text": ">7 years of proven experience as a Back-End Engineer with a strong focus on Node.js development.",
    "entities": [
      [
        76,
        83,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Solid understanding of JavaScript, including ES6+ features and asynchronous programming.",
    "entities": [
      [
        23,
        33,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience with Node.js frameworks such as Express.js or NestJS.",
    "entities": [
      [
        16,
        23,
        "SKILL"
      ],
      [
        43,
        53,
        "SKILL"
      ],
      [
        57,
        63,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Proficiency in building RESTful APIs.",
    "entities": [
      [
        24,
        31,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience with at least one relational or NoSQL database (e.g., PostgreSQL, MySQL, MongoDB).",
    "entities": [
      [
        65,
        75,
        "SKILL"
      ],
      [
        77,
        82,
        "SKILL"
      ],
      [
        84,
        91,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Familiarity with version control systems (e.g., Git).",
    "entities": [
      [
        48,
        51,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience with containerization technologies (e.g., Docker).",
    "entities": [
      [
        53,
        59,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Familiarity with cloud platforms (e.g., AWS, Azure, Google Cloud).",
    "entities": [
      [
        40,
        43,
        "SKILL"
      ],
      [
        45,
        50,
        "SKILL"
      ],
      [
        52,
        64,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience with CI/CD pipelines.",
    "entities": [
      [
        16,
        21,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có từ 03 năm kinh nghiệm làm việc với Reactjs Có nền tảng vững chắc về HTML,CSS, Javascript.",
    "entities": [
      [
        71,
        75,
        "SKILL"
      ],
      [
        76,
        79,
        "SKILL"
      ],
      [
        81,
        91,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm làm việc với công cụ Git, Restful API, GraphQL.",
    "entities": [
      [
        36,
        39,
        "SKILL"
      ],
      [
        41,
        48,
        "SKILL"
      ],
      [
        54,
        61,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có hiểu biết về Server, Docker, AWS Thành thạo Git.",
    "entities": [
      [
        28,
        34,
        "SKILL"
      ],
      [
        36,
        39,
        "SKILL"
      ],
      [
        51,
        54,
        "SKILL"
      ]
    ]
  },
  {
    "text": "• Không yêu cầu kinh nghiệm, được Công ty đào tạo bài bản • Sử dụng tốt Javascript và HTML, CSS.",
    "entities": [
      [
        72,
        82,
        "SKILL"
      ],
      [
        86,
        90,
        "SKILL"
      ],
      [
        92,
        95,
        "SKILL"
      ]
    ]
  },
  {
    "text": "• Kiến thức về HTML5, CSS3, Javascript.",
    "entities": [
      [
        28,
        38,
        "SKILL"
      ]
    ]
  },
  {
    "text": "• Có khả năng đọc hiểu và làm việc với các tài liệu Tiếng Anh.",
    "entities": [
      [
        52,
        61,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kiến thức Astro js, Pug(HTML) Có kinh nghiệm làm việc với ít nhất một framework JavaScript phổ biến như React, Vue.js.",
    "entities": [
      [
        27,
        31,
        "SKILL"
      ],
      [
        83,
        93,
        "SKILL"
      ],
      [
        107,
        112,
        "SKILL"
      ],
      [
        114,
        120,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Sử dụng thành thạo Git.",
    "entities": [
      [
        19,
        22,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Trường hợp không đáp ứng, yêu cầu cung cấp Chứng chỉ về CNTT được cấp bởi các tổ chức uy tín.(5) Kinh nghiệm làm việc thực tế tại các công ty, dự án về vị trí phát triển phần mềm(10) Có kiến thức về quy trình phát triển phần mềm(5) Có kinh nghiệm làm việc về cơ sở dữ liệu: SQL(10) Có kinh nghiệm làm việc về cơ sở dữ liệu: noSQL(5) Có hiểu biết cơ bản về việc sử dụng các công cụ quản trị trong phát triển phần mềm: Jira, Git…(5) Có hiểu biết về về Java core và SpringBoot(15) Có kinh nghiệm triển khai ứng dụng theo dạng Cloud Native: Microservice, CICD, Containerization...(5) Có kinh nghiệm về framework và thư viện: Angula JS,React JS…(5) Ưu tiên nhân sự có kinh nghiệm về các hệ thống Message Queue(5) Ưu tiên nhân sự có hiểu biết về xử lý cache, job(5) Ưu tiên kinh nghiệm phát triển phần mềm trong lĩnh vực tài chính / ngân hàng(5) Ưu tiên Nhân sự đã từng tham gia triển khai các dự án theo mô hình Agile/Scrum(5) Có khả năng đọc viết Tiếng Anh (cơ bản) nghe nói (nếu có thể) Ưu tiên ứng viên có chứng chỉ Tiếng Anh quốc tế (TOEICS 450 trở lên hoặc tương đương)(3) Khả năng quản lý nhóm(5) Khả năng đào tạo, dẫn dắt(4) Sẵn sàng làm việc ngoài giờ hành chính(1) Tự tin, nhanh nhẹn, xử lý tình huống tốt khi đánh giá năng lực(1) Thái độ chuyên nghiệp khi tham gia đánh giá năng lực(1)",
    "entities": [
      [
        423,
        426,
        "SKILL"
      ],
      [
        450,
        454,
        "SKILL"
      ],
      [
        537,
        549,
        "SKILL"
      ],
      [
        631,
        636,
        "SKILL"
      ],
      [
        907,
        912,
        "SKILL"
      ],
      [
        943,
        952,
        "SKILL"
      ],
      [
        1014,
        1023,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có hiểu biết về các ngôn ngữ sau: Java, Python, ....",
    "entities": [
      [
        34,
        38,
        "SKILL"
      ],
      [
        40,
        46,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Ưu tiên các bạn đã từng có 1 project riêng của bản thân Có sự hiểu biết về springboot, Kafka, Redis, mysql, Postgres, Es,...",
    "entities": [
      [
        87,
        92,
        "SKILL"
      ],
      [
        94,
        99,
        "SKILL"
      ],
      [
        101,
        106,
        "SKILL"
      ]
    ]
  },
  {
    "text": "là một lợi thế Có khả năng đọc hiểu và làm việc với các tài liệu Tiếng Anh.",
    "entities": [
      [
        65,
        74,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Tốt nghiệp Đại học trở lên chuyên ngành CNTT hoặc các ngành tương đương hoặc có các chứng chỉ tương đương được công nhận bởi các tổ chức uy tín(5) Có kinh nghiệm làm việc ngành CNTT(5) Kỹ năng lập trình trên database Oracle, SQL Server, MySQL(20) Kỹ năng lập trình trên các nền tảng Core Java, Spring Boot, .Net Framework(20) Kỹ năng thiết kế hệ thống, tối ưu hiệu năng, xử lý đa luồng trong ứng dụng(10) Kỹ năng hiểu decode các hệ thống khác, tự chủ tìm nguyên nhân và giải pháp(5) Có kinh nghiệm về hệ thống thẻ (ưu tiên kinh nghiệm về hệ thống Way4)(5) Có kinh nghiệm về thiết bị HSM (safenet, Thales, eracom …), kinh nghiệm về mã hóa, bảo mật(5) Có kinh nghiệm unit test theo mô hình phát triển DevOps CI/CD(5) Có kinh nghiệm phát triển, triển khai kết nối mảng giao dịch tài chính với đối tác, kinh nghiệm triển khai mảng thanh toán, ví/cổng …(5) Có khả năng đọc viết Tiếng Anh (cơ bản) nghe nói (nếu có thể).",
    "entities": [
      [
        237,
        242,
        "SKILL"
      ],
      [
        288,
        292,
        "SKILL"
      ],
      [
        294,
        305,
        "SKILL"
      ],
      [
        706,
        711,
        "SKILL"
      ],
      [
        873,
        882,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Ưu tiên ứng viên có chứng chỉ Tiếng Anh quốc tế (TOEICS 450 trở lên hoặc tương đương)(5)",
    "entities": [
      [
        30,
        39,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Tối thiểu 04 năm kinh nghiệm trong lĩnh vực lập trình phần mềm hoặc thiết kế hệ thống ứng dụng Có kinh nghiệm thiết kế các hệ thống hoạt động theo mô hình CI/CD, Microservices và sẵn sàng cho việc chuyển đổi lên nền tảng điện toán đám mây.",
    "entities": [
      [
        155,
        160,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm lập trình Java Springboot...",
    "entities": [
      [
        25,
        29,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm triển khai/tham gia phát triển trên các nền tảng (Java): trục tích hợp ESB (WSO2, Apache Camel...), Message Broker, Web Application Server, Memory cache, BPMN 2.0, Spring (Boot, Streaming, Batch...)...",
    "entities": [
      [
        65,
        69,
        "SKILL"
      ],
      [
        86,
        89,
        "SKILL"
      ],
      [
        104,
        109,
        "SKILL"
      ],
      [
        204,
        209,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm làm việc với Redis, Oracle, MongoDB,...",
    "entities": [
      [
        28,
        33,
        "SKILL"
      ],
      [
        43,
        50,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Biết sử dụng Docker, Openshift, K8S Có kinh nghiệm thiết kế các API theo tiêu chuẩn OWASP, đã triển khai các cơ chế mã hóa, giải mã và bảo mật ứng dụng (JWT, RSA, SHA...) Nhiệt tình, năng động, sáng tạo, kỹ năng tìm kiếm, có tư duy tốt, chịu khó học hỏi và nghiên cứu công nghệ mới Có đạo đức, ý thức, trách nhiệm, trung thực Khả năng làm việc theo nhóm hoặc độc lập, chịu được áp lực cao trong công việc.",
    "entities": [
      [
        13,
        19,
        "SKILL"
      ],
      [
        21,
        30,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Ưu tiên ứng viên có kinh nghiệm về native (Swift hoặc Kotlin/ Java).",
    "entities": [
      [
        62,
        66,
        "SKILL"
      ]
    ]
  },
  {
    "text": "HTML, CSS, JS, Typescript ReactJS Git, Github, Gitlab CSS, SCSS, TailwindCSS Material ui hoặc Ant Design, Mantine UI Biết về mono repo là 1 lợi thế Có kinh nghiệm làm FE 1 năm",
    "entities": [
      [
        0,
        4,
        "SKILL"
      ],
      [
        6,
        9,
        "SKILL"
      ],
      [
        15,
        25,
        "SKILL"
      ],
      [
        34,
        37,
        "SKILL"
      ],
      [
        54,
        57,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có trên 3 -5 năm kinh nghiệm phát triển ứng dụng di động đa nền tảng React Native Khả năng tối ưu hóa ứng dụng để đạt hiệu suất tốt trên cả Android và iOS Thành thạo các kiến thức iOS/Android: MultiThread, Memory, Network,...",
    "entities": [
      [
        69,
        74,
        "SKILL"
      ]
    ]
  },
  {
    "text": "là một lợi thế Có kiến thức các ngôn ngữ tương ứng Swift/ Java/ Kotlin là một lợi thế Có kinh nghiệm làm việc với các ứng dụng có tính năng nâng cao như xử lý âm thanh hoặc video, livestream là một lợi thế Có khả năng đọc hiểu tài liệu bằng Tiếng Anh Khả năng làm việc nhóm, giao tiếp tốt và tinh thần học hỏi, cải thiện không ngừng",
    "entities": [
      [
        58,
        62,
        "SKILL"
      ],
      [
        241,
        250,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Đã tốt nghiệp hoặc là sinh viên năm cuối của Khoa CNTT trong các trường Đại học; - Ưu tiên ứng viên có thể tham gia học việc toàn thời gian; - Có tư duy lập trình tốt, có đam mê và mong muốn phát triển nghề nghiệp với CNTT; - Ưu tiên ứng viên đã có hiểu biết về một trong các các ngôn ngữ lập trình, công nghệ: Java, JavaScript, HTML, CSS, ASP.NET, ReactJS, NodeJs, VueJs…",
    "entities": [
      [
        313,
        317,
        "SKILL"
      ],
      [
        319,
        329,
        "SKILL"
      ],
      [
        331,
        335,
        "SKILL"
      ],
      [
        337,
        340,
        "SKILL"
      ],
      [
        360,
        366,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Có ít nhất 02 năm kinh nghiệm phát triển backend đặc biệt là Python (Flask, FastAPI, Celery) .",
    "entities": [
      [
        63,
        69,
        "SKILL"
      ],
      [
        71,
        76,
        "SKILL"
      ],
      [
        78,
        85,
        "SKILL"
      ],
      [
        87,
        93,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Kiến thức CNTT tốt, năng động, trẻ trung và chịu được áp lực - Kinh nghiệm làm việc với các hệ thống quản lý cơ sở dữ liệu SQL & NoSQL (MongoDB, Redis, v.v.) - Am hiểu về CDN, cache (Redis, Memcached), tối ưu hóa hiệu suất backend.",
    "entities": [
      [
        138,
        145,
        "SKILL"
      ],
      [
        147,
        152,
        "SKILL"
      ],
      [
        185,
        190,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Kinh nghiệm làm việc với các công cụ CI/CD (Jenkins, GitLab, v.v.) - Có khả năng nghiên cứu tài liệu, viết tài liệu ở mức thiết kế chi tiết.",
    "entities": [
      [
        39,
        44,
        "SKILL"
      ],
      [
        46,
        53,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Có nền tảng tốt về quản trị Linux/Unix, Windows.",
    "entities": [
      [
        30,
        35,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Có chứng chỉ AWS là một lợi thế.",
    "entities": [
      [
        15,
        18,
        "SKILL"
      ]
    ]
  },
  {
    "text": "• Tối thiểu 02 năm kinh nghiệm làm việc với Java (Spring hoặc JEE) .",
    "entities": [
      [
        44,
        48,
        "SKILL"
      ]
    ]
  },
  {
    "text": "• Kỹ thuật sử dụng: Java (Springboot, MyBatis), Kafka, PostgreSQL, Redis, microservices, docker, Kubernetes, Spark, HBase • Có kinh nghiệm làm việc với xử lý batch, big data, các loại DB NoSQL • Thành thạo các hệ quản trị dữ liệu quan hệ (RDBMS) • Quen thuộc với GIT-flow để quản lý source code • Có kiến thức về OOP, design pattern, bảo mật ứng dụng web • Giao tiếp tốt, chủ động, làm việc nhóm tốt, ý thức chất lượng cao",
    "entities": [
      [
        20,
        24,
        "SKILL"
      ],
      [
        48,
        53,
        "SKILL"
      ],
      [
        55,
        65,
        "SKILL"
      ],
      [
        67,
        72,
        "SKILL"
      ],
      [
        89,
        95,
        "SKILL"
      ],
      [
        97,
        107,
        "SKILL"
      ],
      [
        109,
        114,
        "SKILL"
      ],
      [
        116,
        121,
        "SKILL"
      ],
      [
        158,
        163,
        "SKILL"
      ],
      [
        165,
        173,
        "SKILL"
      ],
      [
        263,
        266,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm về lập trình Mobile (Đặc biệt với Flutter) Có kinh nghiệm lập trình kinh nghiệm lập trình Flutter, Objective C/Swift hoặc Android java, kotlin Có kinh nghiệm sử dụng thành thạo IDE XCode, Android studio, các công cụ hỗ trợ (Simulator, Instrument), Có khả năng nắm vững các khái niệm OOP, MVC, MVVM, Layout, API,...",
    "entities": [
      [
        145,
        149,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kinh nghiệm: 1 năm thực tế với Python và Vue.js, qua dự án cá nhân hoặc công ty.",
    "entities": [
      [
        31,
        37,
        "SKILL"
      ],
      [
        41,
        47,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Thành thạo Python (Django/Flask/FastAPI) và Vue.js (Vue Router, Vuex/Pinia).",
    "entities": [
      [
        11,
        17,
        "SKILL"
      ],
      [
        19,
        25,
        "SKILL"
      ],
      [
        26,
        31,
        "SKILL"
      ],
      [
        32,
        39,
        "SKILL"
      ],
      [
        44,
        50,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kinh nghiệm với PostgreSQL hoặc MongoDB; hiểu biết về thiết kế schema.",
    "entities": [
      [
        16,
        26,
        "SKILL"
      ],
      [
        32,
        39,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Viết và tích hợp RESTful API, nắm vững CRUD và cơ chế xác thực.",
    "entities": [
      [
        17,
        24,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Sử dụng thành thạo Git (branch/PR), VS Code và Postman.",
    "entities": [
      [
        19,
        22,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kiến thức sơ bộ về Microservices, Docker hoặc CI/CD.",
    "entities": [
      [
        34,
        40,
        "SKILL"
      ],
      [
        46,
        51,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Proficiency in Vue.js and core frontend technologies: HTML5, CSS3, and modern JavaScript.",
    "entities": [
      [
        15,
        21,
        "SKILL"
      ],
      [
        78,
        88,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Familiarity with RESTful APIs and integrations.",
    "entities": [
      [
        17,
        24,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Version control experience (Git/GitHub or similar).",
    "entities": [
      [
        28,
        31,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Knowledge of build tools (Webpack, Vite), SCSS/SASS, or Tailwind CSS.",
    "entities": [
      [
        65,
        68,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Từ 2 năm kinh nghiệm làm việc với Java trong dự án thực tế.",
    "entities": [
      [
        34,
        38,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Thành thạo Spring Boot, kiến thức về phân luồng, đồng thời và dịch vụ web (RESTful) Có kinh nghiệm với cơ sở hạ tầng đám mây như AWS, Kubernetes; Ưu tiên ứng viên có kinh nghiệm làm việc với các công nghệ front-end như Angular/ ReactJS....",
    "entities": [
      [
        11,
        22,
        "SKILL"
      ],
      [
        75,
        82,
        "SKILL"
      ],
      [
        129,
        132,
        "SKILL"
      ],
      [
        134,
        144,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm với RDBMS (SQLSERVER, MYSQL) Từng làm việc với máy chủ web/ứng dụng sử dụng mô hình Load Balancing Có kinh nghiệm trong mảng tài chính ngân hàng là một lợi thế.",
    "entities": [
      [
        37,
        42,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm tối thiểu từ 3 năm kinh nghiệm ReactNative.",
    "entities": [
      [
        46,
        57,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Tốt nghiệp CNTT hoặc liên quan, 3+ năm kinh nghiệm React.js.",
    "entities": [
      [
        51,
        56,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Biết kiểm thử với Jasmine/Karma/Selenium, làm việc Agile, Git, Azure DevOps.",
    "entities": [
      [
        51,
        56,
        "SKILL"
      ],
      [
        58,
        61,
        "SKILL"
      ],
      [
        63,
        68,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Giao tiếp tốt, Tiếng Anh thành thạo.",
    "entities": [
      [
        15,
        24,
        "SKILL"
      ]
    ]
  },
  {
    "text": "• Có từ 2 năm kinh nghiệm làm việc với .Net và Entity Framework, .NetCore • Có kinh nghiệm với React js • Có kinh nghiệm xây dựng mô tả API/ Service, • Có kinh nghiệm về queue như Rabbitmq,Kafka • Sử dụng thành thạo ít nhất 1 hệ quản trị cơ sở dữ liệu như: SQLSERVER,MongoDB,Postgress • Có tinh thần trách nhiệm trong công việc, tinh thần tập thể cao; • Chủ động tìm hiểu, học hỏi các công nghệ mới áp dụng vào dự án.",
    "entities": [
      [
        95,
        100,
        "SKILL"
      ],
      [
        180,
        188,
        "SKILL"
      ],
      [
        189,
        194,
        "SKILL"
      ],
      [
        267,
        274,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Thành thạo về CI/CD (Jenkins); công cụ giám sát Grafana, Prometheus; Kubernetes (K8s) - Có tinh thần trách nhiệm và chủ động trong công việc.",
    "entities": [
      [
        16,
        21,
        "SKILL"
      ],
      [
        23,
        30,
        "SKILL"
      ],
      [
        50,
        57,
        "SKILL"
      ],
      [
        59,
        69,
        "SKILL"
      ],
      [
        71,
        81,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Có kỹ năng đọc hiểu tài liệu Tiếng Anh chuyên ngành.",
    "entities": [
      [
        31,
        40,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Từ 3 năm kinh nghiệm làm việc với vị trí lập trình Java, am hiểu về Springboots, Reactjs Có kinh nghiệm làm việc với các hệ quản trị PostgreSql, MySQL.",
    "entities": [
      [
        51,
        55,
        "SKILL"
      ],
      [
        133,
        143,
        "SKILL"
      ],
      [
        145,
        150,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Hiểu biết về vòng đời phát triển phần mềm (waterfall, agile).",
    "entities": [
      [
        54,
        59,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm sử dụng công cụ quản lý version Git.",
    "entities": [
      [
        47,
        50,
        "SKILL"
      ]
    ]
  },
  {
    "text": "ó khả năng làm việc với công cụ Microservices: Docker, K8s, Elastic Container Service (ECS), Elastic Kubernetes Service (EKS)...",
    "entities": [
      [
        47,
        53,
        "SKILL"
      ],
      [
        101,
        111,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có khả năng sử dụng 1 trong số công cụ CI/CD: Jenkins, Code pipeline, Code Build, CloudFormation, Terraform, Chef...",
    "entities": [
      [
        39,
        44,
        "SKILL"
      ],
      [
        46,
        53,
        "SKILL"
      ],
      [
        98,
        107,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có khả năng quản trị vận hành các nền tảng DB như Postgresql, MS SQL, Mysql, Oracle, MongoDB,...",
    "entities": [
      [
        50,
        60,
        "SKILL"
      ],
      [
        70,
        75,
        "SKILL"
      ],
      [
        85,
        92,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kỹ năng triển khai service trên các OS như Windows, Linux...",
    "entities": [
      [
        55,
        60,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có hiểu biết về lập trình cơ bản về NodeJS, .NET, Java, Python...",
    "entities": [
      [
        36,
        42,
        "SKILL"
      ],
      [
        50,
        54,
        "SKILL"
      ],
      [
        56,
        62,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm làm việc về hệ thống cloud: AWS, Google Cloud, Azure,...",
    "entities": [
      [
        43,
        46,
        "SKILL"
      ],
      [
        48,
        60,
        "SKILL"
      ],
      [
        62,
        67,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kiến thức và kinh nghiệm về C# hoặc Java là yêu cầu bắt buộc, có kinh nghiệm với html, reactjs, angular là lợi thế (không bắt buộc).",
    "entities": [
      [
        39,
        43,
        "SKILL"
      ],
      [
        84,
        88,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kiến thức về Web Security, Git Khả năng chịu được áp lực trong công việc cũng như tham gia nhiều dự án cùng lúc.",
    "entities": [
      [
        30,
        33,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có thể giao tiếp và sử dụng Tiếng Anh.",
    "entities": [
      [
        28,
        37,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Required skills/Experience: At least 4 years of experience in Java Spring Boot and 1 year of experience in Angular/React.",
    "entities": [
      [
        62,
        66,
        "SKILL"
      ],
      [
        67,
        78,
        "SKILL"
      ],
      [
        115,
        120,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Familiar with microservice architecture Good at problem-solving and troubleshooting.",
    "entities": [
      [
        14,
        26,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Virtualization, Cloud Computing (AWS, GCP, Azure) background is a plus.",
    "entities": [
      [
        33,
        36,
        "SKILL"
      ],
      [
        43,
        48,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Knowledge of the Agile methodology (Scrum).",
    "entities": [
      [
        17,
        22,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Knowledge of CI/CD (Jenkins, Docker).",
    "entities": [
      [
        13,
        18,
        "SKILL"
      ],
      [
        20,
        27,
        "SKILL"
      ],
      [
        29,
        35,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Restful API Familiarity with Git, Agile/Scrum methodology, and SQL/NoSQL databases.",
    "entities": [
      [
        0,
        7,
        "SKILL"
      ],
      [
        29,
        32,
        "SKILL"
      ],
      [
        34,
        39,
        "SKILL"
      ]
    ]
  },
  {
    "text": "● Develop new functionalities in Java (Spring, Springboot, etc.) and ensure code quality ● Perform unit and integration tests ● Produce quality deliverables for both business and technical improvements ● Write technical specifications ● Be involved in all stages of project implementation (agile ceremonies, unit testing, architecture, etc.) ● Spread your expertise of the Java ecosystem to our customers ● Share your knowledge with your team ● So, do we have our fan of the best practices in development ?",
    "entities": [
      [
        33,
        37,
        "SKILL"
      ],
      [
        290,
        295,
        "SKILL"
      ],
      [
        373,
        377,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Ruby on Rails - HTML/CSS/Javascript - MySQL - AWS (EC2, RDS, ElasticSearch, Redis...) - Long-term focused - Have a start-up mindset, willing to give your best to make things done.",
    "entities": [
      [
        18,
        22,
        "SKILL"
      ],
      [
        23,
        26,
        "SKILL"
      ],
      [
        27,
        37,
        "SKILL"
      ],
      [
        40,
        45,
        "SKILL"
      ],
      [
        48,
        51,
        "SKILL"
      ],
      [
        78,
        83,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- 3+ years of experience in Front End developer position - Strong understanding of HTML5/CSS3/Javascript - Experience with jquery/angularjs - Experience cutting HTML from figma or similar tools - Good understanding of UI/UX",
    "entities": [
      [
        94,
        104,
        "SKILL"
      ],
      [
        161,
        165,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Tốt nghiệp Đại học chuyên ngành CNTT Từ 3 năm kinh nghiệm lập trình Android sử dụng ngôn ngữ Java, Kotlin, Flutter Tiếng Anh đọc, hiểu tốt ƯU TIÊN: Có kinh nghiệm làm việc với khách hàng Nhật; Có khả năng nghiên cứu công nghệ mới và giải quyết vấn đề nhanh; Sẵn sàng và tích cực cập nhật công nghệ, kiến thức liên quan tới công việc.",
    "entities": [
      [
        93,
        97,
        "SKILL"
      ],
      [
        115,
        124,
        "SKILL"
      ]
    ]
  },
  {
    "text": "3+ years of experience in backend development with Java (Spring Boot) Strong object-oriented programming skills.",
    "entities": [
      [
        51,
        55,
        "SKILL"
      ],
      [
        57,
        68,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Solid experience with Node.js, including Express.js and real-time frameworks like SocketCluster.",
    "entities": [
      [
        22,
        29,
        "SKILL"
      ],
      [
        41,
        51,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Proficient in working with MySQL, MongoDB, and Redis.",
    "entities": [
      [
        27,
        32,
        "SKILL"
      ],
      [
        34,
        41,
        "SKILL"
      ],
      [
        47,
        52,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience with Docker, Kafka, and Nginx in production environments.",
    "entities": [
      [
        16,
        22,
        "SKILL"
      ],
      [
        24,
        29,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Nice to Have: Experience in DevOps or CI/CD pipelines.",
    "entities": [
      [
        38,
        43,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Familiarity with cloud platforms (AWS, GCP, or Azure).",
    "entities": [
      [
        34,
        37,
        "SKILL"
      ],
      [
        47,
        52,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Exposure to Agile/Scrum environments.",
    "entities": [
      [
        12,
        17,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có khả năng làm việc với công cụ Microservices: Docker, K8s, Elastic Container Service (ECS), Elastic Kubernetes Service (EKS)...",
    "entities": [
      [
        48,
        54,
        "SKILL"
      ],
      [
        102,
        112,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Yêu thích, có niềm đam mê lĩnh vực nghiên cứu phát triển CNTT, Devops Đọc hiểu tài liệu Tiếng Anh tốt",
    "entities": [
      [
        88,
        97,
        "SKILL"
      ]
    ]
  },
  {
    "text": "• Sinh viên năm 3, 4 hoặc mới tốt nghiệp ngành CNTT, Khoa học máy tính hoặc các ngành liên quan; Yêu cầu lên công ty làm việc ít nhất 1 buổi/ngày • Có kiến thức cơ bản về HTML, CSS, JavaScript.",
    "entities": [
      [
        171,
        175,
        "SKILL"
      ],
      [
        177,
        180,
        "SKILL"
      ],
      [
        182,
        192,
        "SKILL"
      ]
    ]
  },
  {
    "text": "• Đã từng làm việc (dự án cá nhân hoặc nhóm) với một trong các framework như Vue.js, React, hoặc Angular (ưu tiên Vue.js nếu công ty đang dùng).",
    "entities": [
      [
        77,
        83,
        "SKILL"
      ],
      [
        85,
        90,
        "SKILL"
      ],
      [
        114,
        120,
        "SKILL"
      ]
    ]
  },
  {
    "text": "• Biết sử dụng Git cơ bản.",
    "entities": [
      [
        15,
        18,
        "SKILL"
      ]
    ]
  },
  {
    "text": "• Hiểu biết về HTML / CSS / Javascript/ Vuejs • Thành thạo ReactJS • Có khả năng đọc hiểu tài liệu Tiếng Anh.",
    "entities": [
      [
        15,
        19,
        "SKILL"
      ],
      [
        22,
        25,
        "SKILL"
      ],
      [
        28,
        38,
        "SKILL"
      ],
      [
        99,
        108,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Độ tuổi: 25-35 tuổi - Có kinh nghiệm lập trình với ngôn ngữ Python, framework Django trên 1 năm - Có khả năng đưa ra giải pháp kỹ thuật cho dự án - Có khả năng review code - Kỹ năng làm việc nhóm và trao đổi thông tin tốt - Nhiệt tình và có trách nhiệm trong công việc - Có kinh nghiệm lead team là một lợi thế - Tiếng Anh hoặc tiếng Nhật tốt là điểm cộng.",
    "entities": [
      [
        62,
        68,
        "SKILL"
      ],
      [
        80,
        86,
        "SKILL"
      ],
      [
        315,
        324,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Từ 1.5 năm kinh nghiệm làm việc với Java trong dự án thực tế.",
    "entities": [
      [
        36,
        40,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Tối thiểu 2 năm kinh nghiệm phát triển backend với một trong các công nghệ:Node.js hoặc Python/Django Có kinh nghiệm trong:Thiết kế và triển khai RESTful API./Quản lý và tối ưu cơ sở dữ liệu (PostgreSQL hoặc MongoDB)./Xử lý dữ liệu đánh giá, mô hình tính điểm, hệ thống chấm điểm định lượng.",
    "entities": [
      [
        75,
        82,
        "SKILL"
      ],
      [
        88,
        94,
        "SKILL"
      ],
      [
        95,
        101,
        "SKILL"
      ],
      [
        146,
        153,
        "SKILL"
      ],
      [
        192,
        202,
        "SKILL"
      ],
      [
        208,
        215,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kỹ năng làm việc độc lập tốt, đồng thời có khả năng phối hợp nhóm hiệu quả trong môi trường Agile/Scrum.",
    "entities": [
      [
        92,
        97,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kinh nghiệm triển khai hệ thống trên Linux server, Docker, hoặc CI/CD pipeline.",
    "entities": [
      [
        37,
        42,
        "SKILL"
      ],
      [
        51,
        57,
        "SKILL"
      ],
      [
        64,
        69,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Bắt buộc có hiểu biết cơ bản về HTML, CSS, Bootstrap và JavaScript.",
    "entities": [
      [
        32,
        36,
        "SKILL"
      ],
      [
        38,
        41,
        "SKILL"
      ],
      [
        56,
        66,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Bachelor's degree in software engineering, computer science, information technology, information systems, or similar 2+ years of experience in a DevOps role Expertise in AWS, Google Cloud Platform, and/or Azure Strong knowledge of CI/CD tools such as Jenkins, GitLab, Github Actions,..",
    "entities": [
      [
        170,
        173,
        "SKILL"
      ],
      [
        175,
        187,
        "SKILL"
      ],
      [
        205,
        210,
        "SKILL"
      ],
      [
        231,
        236,
        "SKILL"
      ],
      [
        251,
        258,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Advanced knowledge of programming languages such as Python and Java, and writing code and scripts Ability to install and configure software, gather test-stage data, and perform de-bugging Ability to ensure smooth software deployment by writing script updates and running diagnostics Proficiency in documenting processes and monitoring performance metrics Advanced knowledge of best practices related to data encryption and cybersecurity Experience integrating project management and collaboration tools such as Jira and Confluence with development processes and delivery pipelines is a plus Ability to keep up with software development trends and innovation Preferred certifications: AWS, GCP, ITIL, Net+ Good communication in English",
    "entities": [
      [
        52,
        58,
        "SKILL"
      ],
      [
        63,
        67,
        "SKILL"
      ],
      [
        684,
        687,
        "SKILL"
      ]
    ]
  },
  {
    "text": "4–6 years of professional experience in full stack development, with strong expertise in both backend (Java) and frontend (React.js) technologies.",
    "entities": [
      [
        103,
        107,
        "SKILL"
      ],
      [
        123,
        128,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Proficient in Java/JEE and modern frameworks including Spring Boot, Spring Security, and Spring Data.",
    "entities": [
      [
        14,
        18,
        "SKILL"
      ],
      [
        55,
        66,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Hands-on experience developing scalable web applications using React.js, with a solid understanding of modern JavaScript (ES6+), HTML5, and CSS3.",
    "entities": [
      [
        63,
        68,
        "SKILL"
      ],
      [
        110,
        120,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Strong understanding of RESTful API design, development, and integration.",
    "entities": [
      [
        24,
        31,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Proficiency in using version control systems such as Git (GitHub, Bitbucket) and collaborative development workflows (PRs, code reviews).",
    "entities": [
      [
        53,
        56,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Solid experience working with relational databases (PostgreSQL, MySQL) and NoSQL solutions (MongoDB); performance tuning experience is a plus.",
    "entities": [
      [
        52,
        62,
        "SKILL"
      ],
      [
        64,
        69,
        "SKILL"
      ],
      [
        92,
        99,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience with containerization tools like Docker.",
    "entities": [
      [
        44,
        50,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Exposure to CI/CD pipelines and DevOps tools (e.g., Jenkins, GitLab CI, GitHub Actions).",
    "entities": [
      [
        12,
        17,
        "SKILL"
      ],
      [
        52,
        59,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Skilled in AWS, GCP, Azure, and Kubernetes (K8s); experienced in designing and deploying cloud-native applications and managing containerized environments.",
    "entities": [
      [
        11,
        14,
        "SKILL"
      ],
      [
        21,
        26,
        "SKILL"
      ],
      [
        32,
        42,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Ability to collaborate effectively in a cross-functional team and thrive in a fast-paced, agile development environment.",
    "entities": [
      [
        90,
        95,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kiến thức kỹ thuật: Hiểu biết về quy trình phát triển phần mềm, các công cụ quản lý dự án Agile như JIRA, Trello, v.v.",
    "entities": [
      [
        90,
        95,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kiến thức tốt, vững vàng về networking (bắt buộc) Hiểu biết tốt về HĐH Linux.",
    "entities": [
      [
        71,
        76,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm trong việc cài đặt, vận hành và khắc phục sự cố đối với các dịch vụ trong môi trường Linux (bắt buộc) Có kinh nghiệm trong việc cài đặt và vận hành hệ thống on-premise Kubernetes (bắt buộc) Có hiểu biết về các công cụ như Ansible và Terraform là một lợi thế Có kinh nghiệm trong linh vực bảo mật, có các chứng chỉ liên quan về system engineer là một lợi thế",
    "entities": [
      [
        100,
        105,
        "SKILL"
      ],
      [
        183,
        193,
        "SKILL"
      ],
      [
        237,
        244,
        "SKILL"
      ],
      [
        248,
        257,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Tốt nghiệp Đại học trở lên các chuyên ngành: Công nghệ thông tin, Khoa học máy tính, Điện tử viễn thông, Phần mềm Graduated from University or higher with majors such as: Information Technology, Computer Science, Electronics and Telecommunications, Software Có ít nhất 3 năm với việc phát triển các dự án thực tế trong quá trình đi làm Have at least 3 years of experience in developing real projects during the work process Có khả năng hiểu và giao tiếp Tiếng Anh cơ bản Able to understand and communicate in basic English Thành thạo ít nhất 01 ngôn ngữ BackEnd: Java, NodeJS,..",
    "entities": [
      [
        454,
        463,
        "SKILL"
      ],
      [
        563,
        567,
        "SKILL"
      ],
      [
        569,
        575,
        "SKILL"
      ]
    ]
  },
  {
    "text": "và các framework kèm theo như SpringBoot, SpringCloud, SpringSecurity, NestJs, Express,..",
    "entities": [
      [
        71,
        77,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Proficient in at least 01 BackEnd language: Java, NodeJS,..",
    "entities": [
      [
        44,
        48,
        "SKILL"
      ],
      [
        50,
        56,
        "SKILL"
      ]
    ]
  },
  {
    "text": "and accompanying frameworks such as SpringBoot, SpringCloud, SpringSecurity, NestJs, Express,..",
    "entities": [
      [
        77,
        83,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Ưu tiên có kinh nghiệm về CI/CD, nền tảng ghi logs, nền tảng giám sát Priority is given to having experience in CI/CD, logging platforms, monitoring platforms Quen thuộc với các frameworks kiểm thử như Vitest và Jest Familiarity with testing frameworks such as Vitest and Jest Nắm vững kiến thức khoa học máy tính (lập trình OOP, Cấu trúc dữ liệu & Thuật toán) Firm grasp of computer science (OOP programming, Data Structures & Algorithm) Hiểu biết về JPA/ORM, Hibernate, ..Sử dụng các công nghệ như Kafka, Elasticsearch, Redis, Cassandra, .v.v.",
    "entities": [
      [
        26,
        31,
        "SKILL"
      ],
      [
        112,
        117,
        "SKILL"
      ],
      [
        500,
        505,
        "SKILL"
      ],
      [
        522,
        527,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Understanding of JPA/ORM, Hibernate, ..Using technologies like Kafka, Elasticsearch, Redis, Cassandra, etc.",
    "entities": [
      [
        63,
        68,
        "SKILL"
      ],
      [
        85,
        90,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Thành thạo ít nhất một trong các loại cơ sở dữ liệu sau: Oracle, SQL server, PostgreSQL, Mongodb...",
    "entities": [
      [
        77,
        87,
        "SKILL"
      ],
      [
        89,
        96,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Proficient in at least one of the following database types: Oracle, SQLserver, PostgreSQL, Mongodb...",
    "entities": [
      [
        79,
        89,
        "SKILL"
      ],
      [
        91,
        98,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có thể sử dụng asynchronous(JS) hoặc multithread(Java) để cải thiện năng xuất.",
    "entities": [
      [
        49,
        53,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Can use asynchronous(JS) or multithread(Java) to improve productivity.",
    "entities": [
      [
        40,
        44,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kiến thức Linux OS, Docker hoặc kinh nghiệm DevOps với Kubernetes, Terraform, v.v.",
    "entities": [
      [
        13,
        18,
        "SKILL"
      ],
      [
        23,
        29,
        "SKILL"
      ],
      [
        58,
        68,
        "SKILL"
      ],
      [
        70,
        79,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Knowledge of Linux OS, Docker or DevOps experience with Kubernetes, Terraform, etc.",
    "entities": [
      [
        13,
        18,
        "SKILL"
      ],
      [
        23,
        29,
        "SKILL"
      ],
      [
        56,
        66,
        "SKILL"
      ],
      [
        68,
        77,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm phát triển và sử dụng công nghệ đám mây(GCP, AWS) là một lợi thế.",
    "entities": [
      [
        60,
        63,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Having experience developing and using the cloud(GCP, AWS) is an advantage.",
    "entities": [
      [
        54,
        57,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Tối thiểu 3 năm kinh nghiệm phát triển giao diện người dùng (Frontend), thành thạo ngôn ngữ lập trình Vue.js và JavaScript - Kinh nghiệm làm Shopify App hoặc Themes là lợi thế - Có sự chú ý đến chi tiết và đam mê trong việc xây dựng sản phẩm chất lượng cao - Có khả năng làm việc nhóm tốt và hợp tác hiệu quả với người khác - Kỹ năng giao tiếp tốt và có khả năng giải thích các khái niệm kỹ thuật cho các bộ phận liên quan.",
    "entities": [
      [
        104,
        110,
        "SKILL"
      ],
      [
        114,
        124,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm quản trị hệ điều hành Windows Server, Linux.",
    "entities": [
      [
        53,
        58,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có chứng chỉ liên quan đến IT là một lợi thế (ví dụ: CCNA, MCSA, ...) Thành thạo Tiếng Anh (viết và đọc tài liệu kỹ thuật).",
    "entities": [
      [
        81,
        90,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Nắm vững kiến thức về mạng máy tính, hệ điều hành Windows Server, Linux.",
    "entities": [
      [
        66,
        71,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm quản trị cơ sở dữ liệu SQL Server, MySQL là một lợi thế.",
    "entities": [
      [
        50,
        55,
        "SKILL"
      ]
    ]
  },
  {
    "text": "• Tiếng Anh giao tiếp tốt.",
    "entities": [
      [
        2,
        11,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Hiểu biết về CI/CD, Docker, Kubernetes, microservice architecture.",
    "entities": [
      [
        13,
        18,
        "SKILL"
      ],
      [
        20,
        26,
        "SKILL"
      ],
      [
        28,
        38,
        "SKILL"
      ],
      [
        40,
        52,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Tối thiểu 3+ năm kinh nghiệm làm việc với Agile/Scrum Điểm cộng: Chứng chỉ Agile, tốt nhất là Scrumorg (PSM I, PSM II, PSM III) hoặc Scrum Alliance (Certified Scrum Master) Kỹ năng giao tiếp tuyệt vời, rõ ràng Sự tự tin và kỹ năng lãnh đạo khéo léo.",
    "entities": [
      [
        42,
        47,
        "SKILL"
      ],
      [
        75,
        80,
        "SKILL"
      ]
    ]
  },
  {
    "text": "· Kiến thức và kinh nghiệm về triển khai dự án phần mềm bao gồm:Agile, Scrum Kỹ năng tổ chức, lãnh đạo và dẫn dắt đội ngũ, đặt mục tiêu, thúc đẩy, tạo gắn kết.",
    "entities": [
      [
        64,
        69,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Tiếng Anh từ 6.0 IELTS hoặc 800 TOEIC trở lên, đính kèm các chứng chỉ (nếu có).",
    "entities": [
      [
        0,
        9,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Ưu tiên có kinh nghiệm về Azure Cloud.",
    "entities": [
      [
        26,
        31,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Ưu tiên có kiến thức về Infrastructure as Code (Terraform, Ansible), triển khai hệ thống High Availability, nginx,… Bắt buộc làm việc Full-time từ Thứ Hai-Thứ Sáu (8h30-18h00).",
    "entities": [
      [
        48,
        57,
        "SKILL"
      ],
      [
        59,
        66,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Programming skills in Python, Java, or C#.",
    "entities": [
      [
        22,
        28,
        "SKILL"
      ],
      [
        30,
        34,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience in UI development using React, Vue, or Angular.",
    "entities": [
      [
        35,
        40,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm triển khai áp dụng Scrum tối thiểu 3 năm Có chứng chỉ Scrum Master (PSM, CSM) Thái độ: sự nhiệt tình, cẩn trọng và trách nhiệm với công việc Giao tiếp: trình bày và thuyết phục tốt dựa trên bằng chứng Sử dụng thành thạo Jira, Confluence Có kinh nghiệm về các kỹ thuật estimate theo Story Point, theo giờ Các chỉ số của Agile team: Velocity, Effort hours, burndown chart Kỹ năng của 1 Scrum Master: Facilitate, training, coaching, remove impediment...",
    "entities": [
      [
        334,
        339,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có khả năng đọc hiểu tài liệu Kỹ thuật và chính sách bằng Tiếng Anh.",
    "entities": [
      [
        58,
        67,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Thành thạo Tiếng Anh giao tiếp là một lợi thế.",
    "entities": [
      [
        11,
        20,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Tốt nghiệp Đại học trường Ngoại Thương, KTQD, Thương Mại với các chuyên ngành Quan hệ quốc tế, QTKD, Marketing, XNK hoặc CNTT Có kinh nghiệm từng làm từ 2 lĩnh vực trở lên trong các mảng Mua hàng, XNK, Marketing, FMCG, Sale B2B Thông thạo Tiếng Anh 4 kỹ năng (điều kiện bắt buộc) Nhạy bén có khả năng phân phân tích xử lý thông tin tốt",
    "entities": [
      [
        239,
        248,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Automation and DevOps: Proficiency in DevOps pipelines (e.g., Jenkins, GitLab CI/CD), infrastructure automation tools (e.g., Terraform, Ansible), and container orchestration platforms (e.g., Kubernetes, Docker).",
    "entities": [
      [
        62,
        69,
        "SKILL"
      ],
      [
        78,
        83,
        "SKILL"
      ],
      [
        125,
        134,
        "SKILL"
      ],
      [
        136,
        143,
        "SKILL"
      ],
      [
        191,
        201,
        "SKILL"
      ],
      [
        203,
        209,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Machine Learning and AI: Familiarity with AI/ML frameworks for predictive analytics and anomaly detection (e.g., TensorFlow, PyTorch).",
    "entities": [
      [
        21,
        23,
        "SKILL"
      ],
      [
        42,
        44,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Cloud Technologies: Deep knowledge of multi-cloud environments and services (e.g., AWS, Azure, GCP).",
    "entities": [
      [
        83,
        86,
        "SKILL"
      ],
      [
        88,
        93,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Security and Compliance: Awareness of secure AI practices, GDPR, SOC 2, and IT compliance automation solutions.",
    "entities": [
      [
        45,
        47,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience: Technical Leadership: 10+ years in software engineering or automation roles, with 5+ years in architecture leadership covering AI, AIOps, and automation.",
    "entities": [
      [
        139,
        141,
        "SKILL"
      ]
    ]
  },
  {
    "text": "AIOps Automation: Delivered AI-driven operational workflows and self-healing IT systems.",
    "entities": [
      [
        28,
        30,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Proven expertise in designing pipelines for continuous monitoring and AI-based remediation.",
    "entities": [
      [
        70,
        72,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Continuous Learner: Stays updated on advancements in AI, automation, and IT.",
    "entities": [
      [
        53,
        55,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Tối thiểu 02 năm kinh nghiệm ở vị trí tương đương - Ưu tiên ứng viên biết ứng dụng công cụ AI trong công việc - Tốt nghiệp đại học chuyên ngành kinh tế, ngoại thương, tài chính ngân hàng, công nghệ thông tin, thương mại điện tử...",
    "entities": [
      [
        93,
        95,
        "SKILL"
      ]
    ]
  },
  {
    "text": "+ Có kỹ năng nghe/nói/đọc/viết tài liệu kỹ thuật bằng Tiếng Anh.",
    "entities": [
      [
        54,
        63,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Tốt nghiệp đại học chuyên ngành: CNTT, Logistics, AI hoặc liên quan.",
    "entities": [
      [
        50,
        52,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm làm việc với API (RESTful, JSON, Swagger...), hiểu quy trình tích hợp.",
    "entities": [
      [
        33,
        40,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Ưu tiên ứng viên biết khai thác và ứng dụng AI tool trong công việc.",
    "entities": [
      [
        44,
        46,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Thế mạnh/hiểu biết sâu sắc về các công nghệ chuyển đổi số (ví dụ: Cloud, Big Data, AI, IoT,...).",
    "entities": [
      [
        73,
        81,
        "SKILL"
      ],
      [
        83,
        85,
        "SKILL"
      ],
      [
        87,
        90,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Ít nhất 05 năm kinh nghiệm phát triển các sản phẩm/dự án xây dựng bằng ngôn ngữ Java, trong đó có ít nhất 1 năm kinh nghiệm quản lý team Tốt nghiệp đại học loại Khá trở lên, chuyên ngành Công nghệ thông tin, Kỹ sư phần mềm.",
    "entities": [
      [
        80,
        84,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Tiếng Anh tương đương 650+ TOEIC Thành thạo Java Core, các framework Java như EE, Spring, Struts, Hibernate ...",
    "entities": [
      [
        0,
        9,
        "SKILL"
      ],
      [
        44,
        48,
        "SKILL"
      ],
      [
        69,
        73,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Thành thạo SQL, PL/SQL, có kiến thức về các hệ quản trị cơ sở dữ liệu Oracle/MySQL, noSQL, có khả năng tối ưu CSDL Ưu tiên có hiểu biết về nghiệp vụ tài chính, có kinh nghiệm về microservices, ham học hỏi tìm tòi sáng tạo cái mới",
    "entities": [
      [
        77,
        82,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Am hiểu phương pháp quản lý dự án Waterfall, Agile, Scrum.",
    "entities": [
      [
        45,
        50,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Sử dụng tốt Tiếng Anh chuyên ngành.",
    "entities": [
      [
        12,
        21,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kỹ năng đọc hiểu tài liệu kỹ thuật bằng Tiếng Anh.",
    "entities": [
      [
        40,
        49,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kỹ năng quản lý dự án, nắm rõ các phương thức quản lý phổ biến như Waterfall, Agile, Scrum là một điểm mạnh..",
    "entities": [
      [
        81,
        86,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Ưu tiên có kinh nghiệm Kho dữ liệu (DWH) hoặc phát triển báo cáo trong ngân hàng Yêu cầu có Tiếng Anh",
    "entities": [
      [
        92,
        101,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Tiếng Anh giao tiếp, đọc hiểu tài liệu chuyên môn.",
    "entities": [
      [
        2,
        11,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Hiểu biết về Phân tích dữ liệu, Microservice, SaaS Hiểu biết về cơ sở dữ liệu, tư duy phân tích nghiệp vụ Thành thạo các công cụ để xây dựng prototype, mockup, flowchart, mind map.",
    "entities": [
      [
        32,
        44,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm triển khai phần mềm theo mô hình Agile - SCRUM, làm việc được trên Jira Có kỹ năng hình tượng mô hình hệ thống tốt.",
    "entities": [
      [
        48,
        53,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Ưu tiên Tiếng Anh tốt.",
    "entities": [
      [
        8,
        17,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kiến thức phát triển phần mềm (Agile, Waterfall), UI/UX, DFD.",
    "entities": [
      [
        34,
        39,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Tiếng Anh giao tiếp và đọc hiểu tài liệu.",
    "entities": [
      [
        0,
        9,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Từ 3 - 5 năm kinh nghiệm phát triển các sản phẩm/dự án xây dựng bằng ngôn ngữ Java/PHP Ít nhất 1 năm kinh nghiệm Team Leader dự án từ 3-5 developer trở lên.",
    "entities": [
      [
        78,
        82,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Đã có ít nhất 2 năm kinh nghiệm làm việc với GIT hoặc Bitbucket.",
    "entities": [
      [
        45,
        48,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có tư duy lập trình hướng đối tượng MVC, đọc hiểu Tiếng Anh tốt để phục vụ cho công việc.",
    "entities": [
      [
        50,
        59,
        "SKILL"
      ]
    ]
  },
  {
    "text": "【KỸ NĂNG MONG MUỐN】 Có kiến thức liên quan đến Performance của MySQL Statement và Query.",
    "entities": [
      [
        63,
        68,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Ưu tiên những ứng viên có kinh nghiệm sử dụng Docker để phát triển dự án.",
    "entities": [
      [
        46,
        52,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kiến thức và kinh nghiệm về Linux Cloud Server: AWS, GCP, Azure,v.v là một lợi thế.",
    "entities": [
      [
        31,
        36,
        "SKILL"
      ],
      [
        51,
        54,
        "SKILL"
      ],
      [
        61,
        66,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm trong môi trường Agile/Scrum, am hiểu nguyên tắc và quy trình phát triển sản phẩm Agile.",
    "entities": [
      [
        32,
        37,
        "SKILL"
      ],
      [
        97,
        102,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Tối thiểu 5 năm kinh nghiệm phát triển sản phẩm với Python, với trải nghiệm thực chiến trong môi trường production.",
    "entities": [
      [
        52,
        58,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Hiểu biết về mô hình phát triển SaaS product, quy trình CI/CD, monitoring.",
    "entities": [
      [
        56,
        61,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Đam mê, yêu thích công nghệ AI/ML, sẵn sàng học hỏi và áp dụng vào sản phẩm.",
    "entities": [
      [
        28,
        30,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Có kinh nghiệm lập trình với ngôn ngữ PHP, Python, framework Laravel, Django trên 3 năm - Có khả năng đưa ra giải pháp kỹ thuật cho dự án - Có khả năng review code ở level spec - Kỹ năng làm việc nhóm và trao đổi thông tin tốt - Nhiệt tình và có trách nhiệm trong công việc - Có kinh nghiệm lead team là một lợi thế - Tiếng Nhật N2 trở lên, ưu tiên giao tiếp tốt (không yêu cầu chứng chỉ) - Có kinh nghiệm làm việc ở Nhật là một lợi thế - Tiếng Anh tốt là điểm cộng.",
    "entities": [
      [
        45,
        51,
        "SKILL"
      ],
      [
        72,
        78,
        "SKILL"
      ],
      [
        441,
        450,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Hiểu biết về quy trình phát triển phần mềm (Agile/Scrum, Waterfall...) Thành thạo các công cụ hỗ trợ BA như Jira, Confluence, Visio, Figma, Balsamiq, Draw.io...",
    "entities": [
      [
        44,
        49,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Khả năng đọc hiểu tài liệu Tiếng Anh, giao tiếp cơ bản là một lợi thế.",
    "entities": [
      [
        27,
        36,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Thành thạo ít nhất một ngôn ngữ lập trình phổ biến như Java, Python, C++, C hoặc PHP.",
    "entities": [
      [
        55,
        59,
        "SKILL"
      ],
      [
        61,
        67,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm làm việc với các hệ quản trị cơ sở dữ liệu như MySQL, PostgreSQL, SQL Server hoặc Oracle.",
    "entities": [
      [
        62,
        67,
        "SKILL"
      ],
      [
        69,
        79,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kỹ năng Tiếng Anh tốt (đọc, viết).",
    "entities": [
      [
        8,
        17,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Tốt nghiệp chuyên ngành Khoa học máy tính, Công nghệ phần mềm, Công nghệ thông tin hoặc tương đương là một lợi thế Có chứng chỉ các khóa học kiểm thử là một lợi thế Cẩn thận, tư duy logic tốt, đam mê thử nghiệm và thích “vạch lá tìm sâu” Có tinh thần trách nhiệm, bền bỉ Có khả năng chịu áp lực công việc, chịu khó, chủ động và có trách nhiệm cao Có kinh nghiệm ở vị trí liên quan là 1 lợi thế Kỹ năng giao tiếp tốt Yêu cầu Tiếng Anh tốt (kỹ năng nghe, nói, đọc, viết)",
    "entities": [
      [
        424,
        433,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Tiếng Anh: tương đương 650+ TOEIC trở lên Có ít nhất 02 năm kinh nghiệm ở vị trí Solution Architect, Solution Design hoặc các vị trí tương đương, (ưu tiên kinh nghiệm thiết kế các hệ thống lớn, đặc biệt là các hệ thống tài chính) Sở hữu ít nhất 05 năm kinh nghiệm Software Developer (ưu tiên các Developer sử dụng ngôn ngữ Java, JavaScript) Yêu thích tìm hiểu công nghệ, cập nhật xu hướng công nghệ mới và có khả năng phân tích ứng dụng công nghệ trong các bài toán cụ thể Hiểu biết và nắm vững quy trình phát triển phần mềm Am hiểu các hệ điều hành và cơ sở dữ liệu khác nhau",
    "entities": [
      [
        0,
        9,
        "SKILL"
      ],
      [
        323,
        327,
        "SKILL"
      ],
      [
        329,
        339,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Technical Skills 5+ years of experience in Python programming (or equivalent experience in other programming languages).",
    "entities": [
      [
        43,
        49,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience with JavaScript, HTML5, CSS.",
    "entities": [
      [
        16,
        26,
        "SKILL"
      ],
      [
        35,
        38,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Strong knowledge of relational databases (PostgreSQL, Oracle, MySQL, MSSQL, etc.).",
    "entities": [
      [
        42,
        52,
        "SKILL"
      ],
      [
        62,
        67,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience working with Git.",
    "entities": [
      [
        24,
        27,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience with Django framework.",
    "entities": [
      [
        16,
        22,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Familiarity with Bootstrap CSS framework.",
    "entities": [
      [
        27,
        30,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience working with at least one major cloud provider: AWS, Azure, or GCP.",
    "entities": [
      [
        59,
        62,
        "SKILL"
      ],
      [
        64,
        69,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Knowledge of Docker, Kubernetes, and CI/CD pipelines.",
    "entities": [
      [
        13,
        19,
        "SKILL"
      ],
      [
        21,
        31,
        "SKILL"
      ],
      [
        37,
        42,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience with Big Data platforms/solutions (Splunk, ELK, Opensearch, etc.).",
    "entities": [
      [
        16,
        24,
        "SKILL"
      ]
    ]
  },
  {
    "text": "• Thành thạo SQL và kỹ năng xử lý dữ liệu trên Oracle/PostgreSQL • Thành thao ngôn ngữ javascript.",
    "entities": [
      [
        54,
        64,
        "SKILL"
      ],
      [
        87,
        97,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có khả năng thao tác, cấu hình dịch vụ trên các thiết bị của Cisco, HPE, Dell,… Có khả năng đọc và hiểu các tài liệu chuyên ngành bằng Tiếng Anh Linh động về thời gian: Có khả năng làm ngoài giờ, cuối tuần và đi công tác tỉnh.",
    "entities": [
      [
        135,
        144,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Sinh viên thuộc các ngành: CNTT, Hệ thống thông tin quản lý; quản trị dự án;… Ngoại ngữ: đọc hiểu tài liệu chuyên ngành, giao tiếp tốt bằng Tiếng Anh.",
    "entities": [
      [
        140,
        149,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có ít nhất 4 năm kinh nghiệm hoặc tham gia các dự án Moblie, đặc biệt là React Native Kinh nghiệm phát triển super app là một lợi thế Có kiến thức về HTML và CSS, Javascript, Bootstrap, Redux, Material UI.",
    "entities": [
      [
        73,
        78,
        "SKILL"
      ],
      [
        150,
        154,
        "SKILL"
      ],
      [
        158,
        161,
        "SKILL"
      ],
      [
        163,
        173,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kinh nghiệm về React Native, ReactJs, NextJS, Kotlin hoặc Swift.",
    "entities": [
      [
        15,
        20,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kinh nghiệm xử lý Restful API, sử dụng các thư viện của bên thứ ba.",
    "entities": [
      [
        18,
        25,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kiến thức về OOP, thiết kế hệ thống, cấu trúc thuật toán và tối ưu hóa hiệu suất ứng dụng React Native.",
    "entities": [
      [
        90,
        95,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kinh nghiệm làm việc theo phương pháp Agile/Scrum và sử dụng các công cụ quản lý dự án như JIRA hoặc Trello.",
    "entities": [
      [
        38,
        43,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Khả năng nói, nghe, đọc hiểu tài liệu kỹ thuật Tiếng Anh Nắm vững các nguyên lý hoạt động của các thiết bị điện tử, viễn thông.",
    "entities": [
      [
        47,
        56,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Tính sáng tạo cao; am hiểu các thể loại game Mobile; đam mê và yêu thích về game; Có hiểu biết cơ bản về các yếu tố khi thiết kế game như interest curves, fun factors, user motivation, core loop, progression...; Có khả năng làm việc đúng quy trình, đúng yêu cầu được giao với thái độ tích cực và cởi mở Kỹ năng giao tiếp tốt (viết và trình bày); Có thể làm việc độc lập và làm việc nhóm tốt Có tư duy logic, tìm kiếm, phân tích và tổng hợp thông tin Có khả năng viết document và trình bày ý tưởng logic Có khả năng đọc hiểu Document bằng Tiếng Anh là một điểm cộng Ưu tiên ứng viên có kinh nghiệm xếp level dòng game puzzle hoặc yêu thích việc xếp level trong game.",
    "entities": [
      [
        538,
        547,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Tối thiểu 2 năm kinh nghiệm với Java Core, Spring Boot Đã tốt nghiệp ĐH chuyên ngành CNTT hoặc các chuyên ngành khác tương đương Hiểu biết và từng thực hành phát triển theo DevOps/CI-CD Thành thạo Angular và có khả năng xử lý frontend linh hoạt Kỹ năng lập trình tốt, nắm vững OOP, thuật toán, cấu trúc dữ liệu Có tư duy hệ thống, kỹ năng phân tích và giải quyết vấn đề tốt Ưu tiên ứng viên: Từng phát triển hệ thống microservice Có kinh nghiệm tối ưu hoá hiệu năng và thuật toán",
    "entities": [
      [
        32,
        36,
        "SKILL"
      ],
      [
        43,
        54,
        "SKILL"
      ],
      [
        417,
        429,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Yêu cầu bắt buộc: Tối thiểu 12 tháng kinh nghiệm lập trình Python.",
    "entities": [
      [
        59,
        65,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kinh nghiệm làm việc với cơ sở dữ liệu MySQL hoặc SQL.",
    "entities": [
      [
        39,
        44,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Khả năng đọc hiểu tài liệu Tiếng Anh ở mức khá (bao gồm tài liệu kỹ thuật của n8n và ERPNext).",
    "entities": [
      [
        27,
        36,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Yêu cầu ưu tiên: Có kinh nghiệm lập trình frontend (HTML, JavaScript) là một lợi thế.",
    "entities": [
      [
        52,
        56,
        "SKILL"
      ],
      [
        58,
        68,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Đã từng làm việc với Frappe Framework, MariaDB, hoặc n8n (tạo custom node hoặc tích hợp phức tạp) là lợi thế.",
    "entities": [
      [
        39,
        46,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Job requirements: Must have: Education level: Bachelor degree in Computer Science, Information Technology, Computer Engineering or equivalent Solid knowledge of JavaScript and CSS Experienced in integrating JavaScript Tags (e.g., Google Adsense Tag, Google Tag Manager, Facebook, Meta Pixel Tag, etc.) on the Web Basic English (ability to read and chat in English) Nice-to-have: Capable of querying data from multiple tables in a MySQL database, with a strong understanding of MySQL commands.",
    "entities": [
      [
        161,
        171,
        "SKILL"
      ],
      [
        176,
        179,
        "SKILL"
      ],
      [
        207,
        217,
        "SKILL"
      ],
      [
        430,
        435,
        "SKILL"
      ],
      [
        477,
        482,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Have experience of using PHP frameworks: Symfony, Laravel or Cake Experience using Git Experience using Linux server (Ubuntu, Debian), Nginx web server Can work independently and team work Ability to learn and understand new and emerging technologies Good communication skills, problem-solving skills High responsibility and hard-working",
    "entities": [
      [
        83,
        86,
        "SKILL"
      ],
      [
        104,
        109,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Can work fulltime Can submit recommendation letter Technical Skills: Basic level in C#, Python Strong logical and analytical thinking Effective teamwork and collaboration abilities Good time management and task prioritization skills",
    "entities": [
      [
        88,
        94,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Preferred experience in Agile/Scrum processes.",
    "entities": [
      [
        24,
        29,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Độ tuổi dưới 30 tuổi Tiếng Anh chuyên ngành đọc hiểu tốt.",
    "entities": [
      [
        21,
        30,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kinh nghiệmtối thiểu 2 năm làm việc tại vị trítương đương Làm việc với lậptrình Mobile trên nền tảng Android hoặc iOS Thành thạo các ngôn ngữ Java (Android) hoặc Swift/Objective-C (iOS).",
    "entities": [
      [
        142,
        146,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Thành thạo các Framework: Flutte & React native Trải nghiệmvới các thư viện và API của bên thứ ba Có kiến thức tốt về lập trình hướng đối tượng Kỹ năng phân tích tuyệt vời và thái độ giải quyết vấn đề tốt Khả năng thực hiện trong môi trường nhóm Có kinh nghiệm đăng ký tài khoảnapple & xử lý các tình huống khi đẩy APP lên store.",
    "entities": [
      [
        35,
        40,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có ít nhất 1 năm nghiên cứu/ứng dụng AI Có kinh nghiệm đào tạo AI, tạo câu lệnh prompts để yêu cầu AI Có kinh nghiệm xây dựng template/kịch bản ứng dụng AI Có kiến thức tốt về thống kê và phân tích Đam mê nghiên cứu ứng dụng AI",
    "entities": [
      [
        37,
        39,
        "SKILL"
      ],
      [
        63,
        65,
        "SKILL"
      ],
      [
        99,
        101,
        "SKILL"
      ],
      [
        153,
        155,
        "SKILL"
      ],
      [
        225,
        227,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kiến thức cơ bản về phần cứng máy tính, thiết bị văn phòng, hệ thống mạng LAN/WAN, hệ điều hành Windows/Linux.",
    "entities": [
      [
        107,
        112,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Từ 1 -2 năm kinh nghiệm ( Chấp nhận kinh nghiệm thực tập ở những công ty về AI) Có kiến thức và kinh nghiệm với các công cụ automation (Power Automate, Zapier, UiPath, Make.com).",
    "entities": [
      [
        76,
        78,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có hiểu biết hoặc kinh nghiệm thực tế với các công cụ AI ứng dụng (ChatGPT, Copilot, Notion AI, v.v.).Giám sát nhân viên Có khả năng sử dụng API, webhook, hiểu biết cơ bản về JSON, RESTful API là lợi thế.",
    "entities": [
      [
        54,
        56,
        "SKILL"
      ],
      [
        92,
        94,
        "SKILL"
      ],
      [
        181,
        188,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kiến thức cơ bản về API, JSON, Google Sheet/Excel, JavaScript hoặc Python.",
    "entities": [
      [
        54,
        64,
        "SKILL"
      ],
      [
        70,
        76,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có khả năng sử dụng Autocad Sử dụng thành thạo Word, Excel, PowerPoint Tiếng Anh giao tiếp",
    "entities": [
      [
        71,
        80,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm phát triển Restful Web API Có kiến thức làm việc với các hệ quản trị CSDL: Datatbase MongoDB/MS SQL Server.",
    "entities": [
      [
        26,
        33,
        "SKILL"
      ],
      [
        100,
        107,
        "SKILL"
      ]
    ]
  },
  {
    "text": "At least 2.5 years of experience in manual testing knowledge about software/ game testing protocols Experience in software development process Agile/Scrum and JIRA Tool Hands-on experience with SDK & Event tracking testing for mobile applications such as Firebase, MAX, Appsflyer,...",
    "entities": [
      [
        143,
        148,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có khả năng đọc hiểu tài liệu Tiếng Anh kỹ thuật; giao tiếp Tiếng Anh là một lợi thế, Ưu tiên: Biết sử dụng các công cụ hỗ trợ test tự động (Selenium, Postman, JMeter, v.v.) Có kinh nghiệm kiểm thử API hoặc hiểu về database (SQL cơ bản).",
    "entities": [
      [
        30,
        39,
        "SKILL"
      ],
      [
        60,
        69,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Skill Required Minimum 3 years experience on developing with Javascript.",
    "entities": [
      [
        61,
        71,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience operating in an Agile environment, with a deep understanding of agile development principles.",
    "entities": [
      [
        27,
        32,
        "SKILL"
      ],
      [
        75,
        80,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kỹ năng: Có khả năng ứng dụng công nghệ thông tin trong giảng dạy, nghiên cứu Có khả năng đọc và nghiên cứu tài liệu bằng Tiếng Anh.",
    "entities": [
      [
        122,
        131,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có khả năng giao tiếp, giảng dạy bằng Tiếng Anh là một lợi thế.",
    "entities": [
      [
        38,
        47,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Ngôn ngữ: Sử dụng Tiếng Anh hoặc Tiếng Đức tốt trong công việc: 4 kỹ năng Nghe-Nói-Đọc-Viết Kiến thức tổng quan về Công nghệ thông tin.",
    "entities": [
      [
        18,
        27,
        "SKILL"
      ],
       [
        34,
        43,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có hiểu biết về các công nghê của SAP cũng như đã từng sử dụng phần mềm SAP, SAP-Architecture, SAP Netweaver Có kinh nghiệm Database Management, làm việc với ngôn ngữ SQL Có kiến thức hay kinh nghiệm lập trình Python hoặc Ansible Có kinh nghiệm làm việc với các công nghệ containerization như Docker hay Podman",
    "entities": [
      [
        210,
        216,
        "SKILL"
      ],
      [
        222,
        229,
        "SKILL"
      ],
      [
        293,
        299,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Sử dụng thành thạo React JS cho Front End, Python Django DRF (Django REST farmework), Node JS cho Backend.",
    "entities": [
      [
        21,
        26,
        "SKILL"
      ],
      [
        45,
        51,
        "SKILL"
      ],
      [
        52,
        58,
        "SKILL"
      ],
      [
        64,
        70,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Có hiểu biết về HTML&CSS, MQTT Server, cơ sở dữ liệu SQL Server, PostgreSQL, SQLite ...",
    "entities": [
      [
        18,
        22,
        "SKILL"
      ],
      [
        23,
        26,
        "SKILL"
      ],
      [
        67,
        77,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có hiểu biết hoặc đã tìm hiểu về lập trình website mà có sử dụng một trong các ngôn ngữ lập trình PHP, Java, .Net (C#,VB.NET), NodeJS.",
    "entities": [
      [
        103,
        107,
        "SKILL"
      ],
      [
        127,
        133,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Lợi thế: - Có kiến thức về: PHP, MySQL.",
    "entities": [
      [
        33,
        38,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Javascript và JS Framework (VueJS, ReactJS...).",
    "entities": [
      [
        0,
        10,
        "SKILL"
      ]
    ]
  },
  {
    "text": "» Ứng viên vui lòng cập nhật và gửi 2 CV (Tiếng Việt và Tiếng Anh) để được xử lý thông tin ứng tuyển nhanh chóng.",
    "entities": [
      [
        56,
        65,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có 1 năm kinh nghiệm làm việc tại vị trí Frontend Developer với VueJS Biết về UX/UI, CSS3, SCSS, HTML5 Hiểu biết về các công cụ: Visual Studio Code, postman, Git, source tree Có kinh nghiệm trong phát triển các ứng dụng web tích hợp API, REST API Ưu tiên đã từng tham gia triển khai dự án theo mô hình Agile/Scrum Biết về Microservice là một lợi thế.",
    "entities": [
      [
        158,
        161,
        "SKILL"
      ],
      [
        302,
        307,
        "SKILL"
      ],
      [
        322,
        334,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm làm việc theo mô hình Agile/Scrum.",
    "entities": [
      [
        37,
        42,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Thành thạo framework Angular, JS, html 5, CSS, boostrap, node JS,...",
    "entities": [
      [
        34,
        38,
        "SKILL"
      ],
      [
        42,
        45,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Hiểu biết về kiến trúc Microservice (MSA), SOA, Event-Driven Architecture (EDA) Có kinh nghiệm phát triển và tích hợp RESTful API Nắm vững kiến thức về cấu trúc dữ liệu và giải thuật.",
    "entities": [
      [
        23,
        35,
        "SKILL"
      ],
      [
        118,
        125,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Sử dụng thành thạo các IDE phát triển và công cụ quản lý mã nguồn (Git) Hiểu biết và có kinh nghiệm thực tế với DevOps, CI/CD Nhiệt tình, trách nhiệm với công việc Giao tiếp tốt.",
    "entities": [
      [
        67,
        70,
        "SKILL"
      ],
      [
        120,
        125,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có khả năng đọc hiểu, nghiên cứu tài liệu kỹ thuật bằng Tiếng Anh Lập kế hoạch và quản lý thời gian hiệu quả",
    "entities": [
      [
        56,
        65,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Có khả năng tự giải quyết vấn đề, tư duy logic, sáng tạo trong công việc - Có kỹ năng đọc hiểu tài liệu Tiếng Anh chuyên ngành",
    "entities": [
      [
        106,
        115,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Backend experience using Ruby on Rails Experience with REST/RESTFUL, JSONAPI Good knowledge about Web development Strong written and verbal communication skills in English.",
    "entities": [
      [
        60,
        67,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience with SQL databases Experience with Git, Git-flow Nice to have Front-end experience such as Angular, Bootstrap, SCSS Experience with other programming languages (Golang, Dart/Flutter, Typescript) Experience with Microservices, Kafka, Redis...",
    "entities": [
      [
        46,
        49,
        "SKILL"
      ],
      [
        51,
        54,
        "SKILL"
      ],
      [
        172,
        178,
        "SKILL"
      ],
      [
        194,
        204,
        "SKILL"
      ],
      [
        237,
        242,
        "SKILL"
      ],
      [
        244,
        249,
        "SKILL"
      ]
    ]
  },
  {
    "text": "What you’ll need to know: HTML/CSS (SASS) Angular 15+ Javascript/Ajax Responsive Design (Bootstrap framework) Understanding of UI/UX Good English skills What you’ll need to bring: A can-do attitude Good time management, planning and ability to meet deadlines Good written and verbal communication skills",
    "entities": [
      [
        26,
        30,
        "SKILL"
      ],
      [
        31,
        34,
        "SKILL"
      ],
      [
        54,
        64,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có từ 2 - 3 năm kinh nghiệm làm việc với Ruby on Rails Biết về code rails thuần, html, javascript, css Tốt nghiệp đại học chuyên ngành Công nghệ thông tin, Toán tin, Kỹ thuật phần mềm hoặc có kinh nghiệm ở vị trí tương đương.",
    "entities": [
      [
        81,
        85,
        "SKILL"
      ],
      [
        87,
        97,
        "SKILL"
      ],
      [
        99,
        102,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm làm việc với các dự án về tool là 1 lợi thế Sử dụng tốt HTML, CSS, JavaScript, Jquery,… Hiểu rõ kiến thức về OOP, MVC, Coding conventions.",
    "entities": [
      [
        71,
        75,
        "SKILL"
      ],
      [
        77,
        80,
        "SKILL"
      ],
      [
        82,
        92,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm làm việc với cơ sở dữ liệu (MySQL, PostgreSQL, MongDB ...).",
    "entities": [
      [
        43,
        48,
        "SKILL"
      ],
      [
        50,
        60,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Thành thạo các công cụ quản lý mã nguồn: SVN hoặc GIT.",
    "entities": [
      [
        50,
        53,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Tối thiểu 2 năm kinh nghiệm thực tế với React.js hoặc Next.js.",
    "entities": [
      [
        40,
        45,
        "SKILL"
      ],
      [
        54,
        61,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Thành thạo HTML5, CSS3, JavaScript (ES6+).",
    "entities": [
      [
        24,
        34,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm gọi API RESTful, xử lý JSON, xác thực người dùng (OAuth/Firebase Auth).",
    "entities": [
      [
        23,
        30,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Biết sử dụng Git, GitHub/GitLab.",
    "entities": [
      [
        13,
        16,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kinh nghiệm làm việc tốt với MySQL, bao gồm ORM (Doctrine).",
    "entities": [
      [
        29,
        34,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kiến thức về HTML, CSS, và JavaScript, TypeScript.",
    "entities": [
      [
        13,
        17,
        "SKILL"
      ],
      [
        19,
        22,
        "SKILL"
      ],
      [
        27,
        37,
        "SKILL"
      ],
      [
        39,
        49,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kinh nghiệm với framework React là một lợi thế.",
    "entities": [
      [
        26,
        31,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kinh nghiệm xây dựng và tích hợp RESTful APIs hoặc GraphQL.",
    "entities": [
      [
        33,
        40,
        "SKILL"
      ],
      [
        51,
        58,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Thành thạo Git cho quản lý mã nguồn, sử dụng tốt CI/CD và Docker.",
    "entities": [
      [
        11,
        14,
        "SKILL"
      ],
      [
        49,
        54,
        "SKILL"
      ],
      [
        58,
        64,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm về Golang là điểm cộng.",
    "entities": [
      [
        18,
        24,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có khả năng giao tiếp Tiếng Anh trong công việc ở mức khá.",
    "entities": [
      [
        22,
        31,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Yêu cầu Tiếng Anh thành thạo, làm việc trực tiếp với đối tác nước ngoài.",
    "entities": [
      [
        8,
        17,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm với nhiều ngôn ngữ và thư viện FrontEnd (ví dụ: HTML/ CSS, JavaScript/TypeScript, Bootstrap, React, Redux, Node.js...).",
    "entities": [
      [
        63,
        67,
        "SKILL"
      ],
      [
        69,
        72,
        "SKILL"
      ],
      [
        74,
        84,
        "SKILL"
      ],
      [
        85,
        95,
        "SKILL"
      ],
      [
        108,
        113,
        "SKILL"
      ],
      [
        122,
        129,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Nền tảng vững chắc về một trong các ngôn ngữ lập trình: Java, .NET, Python hoặc NodeJS.",
    "entities": [
      [
        56,
        60,
        "SKILL"
      ],
      [
        68,
        74,
        "SKILL"
      ],
      [
        80,
        86,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kiến thức cơ bản về cơ sở dữ liệu SQL và NoSQL, thiết kế RESTful API, Websocket, JSON và XML.",
    "entities": [
      [
        57,
        64,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm làm việc với Git.",
    "entities": [
      [
        28,
        31,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Thành thạo JavaScript (ES6+), HTML, CSS, SCSS.",
    "entities": [
      [
        11,
        21,
        "SKILL"
      ],
      [
        30,
        34,
        "SKILL"
      ],
      [
        36,
        39,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm làm việc với RESTful API và hiểu biết về mô hình Client-Server.",
    "entities": [
      [
        28,
        35,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Biết sử dụng các thư viện như Redux, React Query, hoặc Zustand là một lợi thế.",
    "entities": [
      [
        37,
        42,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm làm việc với Git và quy trình phát triển phần mềm Agile/Scrum.",
    "entities": [
      [
        28,
        31,
        "SKILL"
      ],
      [
        65,
        70,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Ưu tiên ứng viên có kinh nghiệm với TypeScript, Next.js hoặc hệ thống CI/CD.",
    "entities": [
      [
        36,
        46,
        "SKILL"
      ],
      [
        48,
        55,
        "SKILL"
      ],
      [
        70,
        75,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Ưu tiên ứng viên có kinh nghiệm với NextJs và NuxtJs • Code được CRUD phía BE với PHP thuần là một điểm cộng • Thành thạo HTML, CSS, JavaScript và TypeScript • Hiểu biết sâu về các nguyên tắc thiết kế UI/UX, tối ưu SEO cho trang web thương mại điện tử • Kinh nghiệm với các công cụ và thư viện front-end như Vuex, Pinia, Redux, và Ant design, Material UI • Kinh nghiệm làm việc với RESTful APIs và WebSockets • Hiểu biết về các công cụ build và quản lý dự án như Webpack, Vite, và npm/yarn • Kỹ năng làm việc nhóm tốt và khả năng giao tiếp hiệu quả • Kinh nghiệm với Git và các hệ thống quản lý source code • Khả năng làm việc trong môi trường Agile/Scrum",
    "entities": [
      [
        122,
        126,
        "SKILL"
      ],
      [
        128,
        131,
        "SKILL"
      ],
      [
        133,
        143,
        "SKILL"
      ],
      [
        147,
        157,
        "SKILL"
      ],
      [
        382,
        389,
        "SKILL"
      ],
      [
        567,
        570,
        "SKILL"
      ],
      [
        644,
        649,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Có kinh nghiệm làm việc theo mô hình Agile/Scrum.",
    "entities": [
      [
        39,
        44,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kỹ năng: - Thành thạo ngôn ngữ lập trình Angular, JS, html 5, CSS, boostrap - Hiểu biết về kiến trúc Microservice (MSA), SOA, Event-Driven Architecture (EDA) - Có kinh nghiệm phát triển và tích hợp RESTful API - Nắm vững kiến thức về cấu trúc dữ liệu và giải thuật.",
    "entities": [
      [
        54,
        58,
        "SKILL"
      ],
      [
        62,
        65,
        "SKILL"
      ],
      [
        101,
        113,
        "SKILL"
      ],
      [
        198,
        205,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Sử dụng thành thạo các IDE phát triển và công cụ quản lý mã nguồn (Git) - Hiểu biết và có kinh nghiệm thực tế với DevOps, CI/CD",
    "entities": [
      [
        69,
        72,
        "SKILL"
      ],
      [
        124,
        129,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kiến thức cơ bản về ngôn ngữ Nodejs.",
    "entities": [
      [
        32,
        38,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Nắm được kiến thức và kĩ năng về JavaScript, ES6, Restful API, HTML, css, bootstrap, Jquery Khả năng đọc hiểu tài liệu Tiếng Anh.",
    "entities": [
      [
        33,
        43,
        "SKILL"
      ],
      [
        50,
        57,
        "SKILL"
      ],
      [
        63,
        67,
        "SKILL"
      ],
      [
        69,
        72,
        "SKILL"
      ],
      [
        119,
        128,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có thể thực tập fulltime Ưu tiên: TypeScript, NestJs, MongoDB",
    "entities": [
      [
        34,
        44,
        "SKILL"
      ],
      [
        46,
        52,
        "SKILL"
      ],
      [
        54,
        61,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có từ 1-3 năm kinh nghiệm trong vị trí Full Stack Developer Thành thạo JavaScript (ReactJS / NextJS / VueJS) cho frontend.",
    "entities": [
      [
        71,
        81,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Đã từng làm việc với RESTful API, hiểu biết về Shopify API (Admin API, Storefront API) là một lợi thế lớn.",
    "entities": [
      [
        21,
        28,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kiến thức và kinh nghiệm ứng dụng AI vào quy trình làm việc như: tạo nội dung sản phẩm, gợi ý hình ảnh, cá nhân hóa trải nghiệm người dùng...",
    "entities": [
      [
        37,
        39,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm tối thiểu từ 3 năm kinh nghiệm React Native.",
    "entities": [
      [
        46,
        51,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Skill & Requirement: Proficiency in React.js and TypeScript, including ES6+ features.",
    "entities": [
      [
        36,
        41,
        "SKILL"
      ],
      [
        49,
        59,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience with front-end frameworks and libraries such as Redux, React Router, and Material-UI.",
    "entities": [
      [
        66,
        71,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Familiarity with RESTful APIs and asynchronous request handling.",
    "entities": [
      [
        17,
        24,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience with version control systems like Git.",
    "entities": [
      [
        45,
        48,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Tốt nghiệp đại học, cao đẳng; ưu tiên tốt nghiệp chuyên ngành CNTT, hoặc chuyên ngành liên quan; - Ít nhất 3 năm kinh nghiệm với Frontend (Reactjs, Next.js, và Redux) - Hiểu biết sâu về JavaScript/TypeScript và các tiêu chuẩn ECMAScript mới nhất; - Có kinh nghiệm sử dụng CSS frameworks như TailwindCSS, Material-UI hoặc Styled-Components; - Kỹ năng sử dụng các công cụ kiểm thử (Jest, Cypress) và linting (ESLint, Prettier) - Có hiểu biết về Node.js, Express, và các framework server-side khác; - Kinh nghiệm làm việc với cơ sở dữ liệu như MongoDB, MySQL, hoặc PostgreSQL; - Làm quen với các công cụ message brokers như Kafka, Redis, hoặc WebSocket.",
    "entities": [
      [
        150,
        157,
        "SKILL"
      ],
      [
        188,
        198,
        "SKILL"
      ],
      [
        199,
        209,
        "SKILL"
      ],
      [
        274,
        277,
        "SKILL"
      ],
      [
        445,
        452,
        "SKILL"
      ],
      [
        543,
        550,
        "SKILL"
      ],
      [
        552,
        557,
        "SKILL"
      ],
      [
        564,
        574,
        "SKILL"
      ],
      [
        623,
        628,
        "SKILL"
      ],
      [
        630,
        635,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Your Skills and Experience Must have 01+ years of experience in web development with Nodejs, Web API.",
    "entities": [
      [
        85,
        91,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Have experience with or eager to learn React, Angular, HTML5, and CSS3.",
    "entities": [
      [
        39,
        44,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Facebook API, Webhook, SignalR MySQL, Oracle, MongoDB, Elasticsearch, or Redis.",
    "entities": [
      [
        31,
        36,
        "SKILL"
      ],
      [
        46,
        53,
        "SKILL"
      ],
      [
        73,
        78,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kafka or RabbitMQ.",
    "entities": [
      [
        0,
        5,
        "SKILL"
      ],
      [
        9,
        17,
        "SKILL"
      ]
    ]
  },
  {
    "text": "CI/CD.",
    "entities": [
      [
        0,
        5,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Git (e.g.: Github, Gitlab, Azure DevOps...).",
    "entities": [
      [
        0,
        3,
        "SKILL"
      ],
      [
        27,
        32,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kỹ năng: - Thành thạo ngôn ngữ lập trình Kotlin - Hiểu biết về kiến trúc Microservice (MSA), SOA, Event-Driven Architecture (EDA) - Có kinh nghiệm phát triển và tích hợp RESTful API - Nắm vững kiến thức về cấu trúc dữ liệu và giải thuật.",
    "entities": [
      [
        73,
        85,
        "SKILL"
      ],
      [
        170,
        177,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Có kiến thức cơ bản về HTML, CSS - Có kinh nghiệm làm việc với các framework front-end như React, Next.js là một lợi thế - Nắm vững kiến thức về Javascript, bao gồm CommonJS, ES6+ và các tính năng mới - Có kinh nghiệm với công cụ build Vite.js, hiểu biết sơ về Vitest.",
    "entities": [
      [
        25,
        29,
        "SKILL"
      ],
      [
        31,
        34,
        "SKILL"
      ],
      [
        93,
        98,
        "SKILL"
      ],
      [
        100,
        107,
        "SKILL"
      ],
      [
        147,
        157,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Thành thạo trong việc xử lý bất đồng bộ, hiểu biết về Callback, Promise, Async/Await - Có kinh nghiệm làm việc với các module quan trọng của NodeJS phổ biến như : path, os, child_process, … - Có kinh nghiệm làm việc với cơ sở dữ liệu SQLite và hiểu về ORM - Có kỹ năng Debugging hiệu quả - Có tư duy lập trình tốt - Có khả năng đọc hiểu tài liệu Tiếng Anh, khả năng tự học - Có khả năng sử dụng Google để tìm kiếm và giải quyết vấn đề - Có hiểu biết và kinh nghiệm về quản lý bộ nhớ, hiệu năng trong NodeJS là một lợi thế - Có kinh nghiệm làm việc với Electron JS là một lợi thế",
    "entities": [
      [
        143,
        149,
        "SKILL"
      ],
      [
        348,
        357,
        "SKILL"
      ],
      [
        502,
        508,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Thành thạo HTML, CSS, SCSS, Bootstrap.",
    "entities": [
      [
        11,
        15,
        "SKILL"
      ],
      [
        17,
        20,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Thành thạo ngôn ngữ lập trình JavaScript, jQuery.",
    "entities": [
      [
        30,
        40,
        "SKILL"
      ]
    ]
  },
  {
    "text": "At least 6 months of experience with JavaScript, React.js; Knowledgeable about HTML5, CSS3, SASS, SCSS, and Bootstrap CSS; Knowledgeable about Shopify, Shopify theme, Liquid,..., is an advantage; Experience working with Git, Restful API, and GraphQL; Strong skills in UI, and UX are a plus; Preference for candidates with Node.js experience and aspiring to become Fullstack Developer; Proactive, detail-oriented and well-organised.",
    "entities": [
      [
        37,
        47,
        "SKILL"
      ],
      [
        49,
        54,
        "SKILL"
      ],
      [
        118,
        121,
        "SKILL"
      ],
      [
        220,
        223,
        "SKILL"
      ],
      [
        225,
        232,
        "SKILL"
      ],
      [
        242,
        249,
        "SKILL"
      ],
      [
        322,
        329,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có từ 2 năm kinh nghiệm làm việc với NodeJS (ExpressJS/NestJS) Có từ 2 năm kinh nghiệm làm việc với ReactJS/NextJS Có 1 năm kinh nghiệm làm việc với MongoDB Thành thạo RESTFUL API Có kinh nghiệm về HTML/CSS/Javascript.",
    "entities": [
      [
        37,
        43,
        "SKILL"
      ],
      [
        55,
        61,
        "SKILL"
      ],
      [
        149,
        156,
        "SKILL"
      ],
      [
        168,
        175,
        "SKILL"
      ],
      [
        198,
        202,
        "SKILL"
      ],
      [
        203,
        206,
        "SKILL"
      ],
      [
        207,
        217,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Thành thạo các công cụ: GIT, Jira.",
    "entities": [
      [
        24,
        27,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Nice to have Có hiểu biết về CI/CD, Docker Có kinh nghiệm triển khai dự án thực tế.",
    "entities": [
      [
        29,
        34,
        "SKILL"
      ],
      [
        36,
        42,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kỹ năng giao tiếp tốt, trình bày vấn đề logic Có khả năng lập kế hoạch và quản lý tốt Có khả năng tiếp thu và vận dụng công nghệ mới Có kinh nghiệm phát triển scalable web applications với NodeJS.",
    "entities": [
      [
        192,
        198,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Thành thạo HTML, CSS, JavaScript (React, Vue, Angular, Svelte...).",
    "entities": [
      [
        11,
        15,
        "SKILL"
      ],
      [
        17,
        20,
        "SKILL"
      ],
      [
        22,
        32,
        "SKILL"
      ],
      [
        34,
        39,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Hiểu biết về Docker.",
    "entities": [
      [
        13,
        19,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Tiếng Anh đọc viết tốt.",
    "entities": [
      [
        0,
        9,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Solid understanding of Git, version control workflows, and code review best practices.",
    "entities": [
      [
        23,
        26,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Familiarity with CI/CD tools (e.g., Jenkins, GitLab CI/CD, Bamboo).",
    "entities": [
      [
        17,
        22,
        "SKILL"
      ],
      [
        36,
        43,
        "SKILL"
      ],
      [
        52,
        57,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kinh nghiệm: - 1+ năm kinh nghiệm phát triển Java/Python.",
    "entities": [
      [
        45,
        49,
        "SKILL"
      ],
      [
        50,
        56,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Có kinh nghiệm với phát triển API RESTful và kiến trúc vi dịch vụ là thuận lợi.",
    "entities": [
      [
        36,
        43,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kỹ năng kỹ thuật: - Thành thạo Java và Python.",
    "entities": [
      [
        31,
        35,
        "SKILL"
      ],
      [
        39,
        45,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Có kinh nghiệm với cơ sở dữ liệu quan hệ như MySQL hoặc PostgreSQL và cơ sở dữ liệu NoSQL (ví dụ: MongoDB, Redis).",
    "entities": [
      [
        47,
        52,
        "SKILL"
      ],
      [
        58,
        68,
        "SKILL"
      ],
      [
        100,
        107,
        "SKILL"
      ],
      [
        109,
        114,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Có kinh nghiệm với XML, HTML.",
    "entities": [
      [
        26,
        30,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Thành thạo các hệ thống kiểm soát phiên bản như Git.",
    "entities": [
      [
        50,
        53,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience in one of the following programming languages: Python or C# for data processing and scripting.",
    "entities": [
      [
        58,
        64,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience with relational databases, such as PostgreSQL, MySQL, Oracle, or MS SQL Server.",
    "entities": [
      [
        46,
        56,
        "SKILL"
      ],
      [
        58,
        63,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Understanding of cloud computing platforms (e.g., AWS, GCP, Azure).",
    "entities": [
      [
        50,
        53,
        "SKILL"
      ],
      [
        60,
        65,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Strong communication and collaboration skills, particularly in an Agile environment.",
    "entities": [
      [
        66,
        71,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Preferred (but not required) Experience working with BI tools such as AWS QuickSight, Grafana, or Google Sheets.",
    "entities": [
      [
        70,
        73,
        "SKILL"
      ],
      [
        86,
        93,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Familiarity with the Agile toolset, such as GitLab, Jira, Confluence, and Slack.",
    "entities": [
      [
        21,
        26,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Tối thiểu 02 năm lãnh đạo đội/ phòng BI Thông thạo toàn bộ vòng đời ETL/ELT và thiết kế kho dữ liệu; thành thạo SQL & Python Kinh nghiệm phân tích nghiệp vụ và quy trình, chuyển hóa yêu cầu thành giải pháp dữ liệu có khả năng mở rộng Hiểu biết rộng về công nghệ dữ liệu hiện tại & xu hướng mới và lựa chọn công cụ phù hợp theo từng giai đoạn Kỹ năng quản lý thay đổi, giao tiếp với nhiều cấp độ stakeholder, tự tin trình bày với Ban TGĐ Ưu tiên: kinh nghiệm ngành sản xuất/chuỗi cung ứng, chứng chỉ cloud, hành thạo song ngữ Việt–Anh",
    "entities": [
      [
        118,
        124,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có khả năng xây dựng tài liệu nghiệp vụ dự án (URD, SRS, User Guide, ...) Có khả năng thực hiện SIT, UAT cho các hệ thống Kiến thức về phương pháp Agile (ví dụ: Agile/Scrum) Ưu tiên các ứng viên có kinh nghiệm về CRM/HRM/ERP Sản xuất",
    "entities": [
      [
        147,
        152,
        "SKILL"
      ],
      [
        161,
        166,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Thành thạo Java.",
    "entities": [
      [
        11,
        15,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Đã từng làm việc với RabbitMQ, ActiveMQ, Kafka, Docker, K8S,...",
    "entities": [
      [
        21,
        29,
        "SKILL"
      ],
      [
        41,
        46,
        "SKILL"
      ],
      [
        48,
        54,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có khả năng làm việc với Linux.",
    "entities": [
      [
        25,
        30,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Ít nhất 2 năm kinh nghiệm làm việc (hoặc tìm hiểu) về ngành Blockchain / AI Có kiến thức nền tảng vững về lĩnh vực Blockchain, Web3, AI hoặc Công nghệ thông tin; Có kinh nghiệm giảng dạy hoặc truyền đạt kiến thức rõ ràng, dễ hiểu cho cộng đồng; Kỹ năng sư phạm, giao tiếp tốt; sử dụng thành thạo các công cụ giảng dạy online/offline; Ngoại hình ưa nhìn, hoạt ngôn là một lợi thế; Ưu tiên ứng viên biết Tiếng Anh hoặc tiếng Trung.",
    "entities": [
      [
        73,
        75,
        "SKILL"
      ],
      [
        133,
        135,
        "SKILL"
      ],
      [
        402,
        411,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience 3-6 years of experience in frontend development with strong expertise in ReactJS, NextJS, and modern JavaScript.",
    "entities": [
      [
        112,
        122,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Hands-on experience with Node.js to develop APIs and optimize SSR logic.",
    "entities": [
      [
        25,
        32,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Familiarity with modern frontend tools and workflows (e.g., Webpack, Vite, Git).",
    "entities": [
      [
        75,
        78,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Basic understanding of AWS S3, Cloudflare, or similar tools for asset delivery.",
    "entities": [
      [
        23,
        26,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Familiarity with Agile/Scrum Preferred Skills (but not required): Has knowledge of design, and coding principles (e.g.: clean code, DRY/KISS, SOLID) Has knowledge of Postgres, KAFKA, Elasticsearch, S3/Minio Knowledge of testing frameworks like Jest, React Testing Library.",
    "entities": [
      [
        17,
        22,
        "SKILL"
      ],
      [
        176,
        181,
        "SKILL"
      ],
      [
        250,
        255,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Familiarity with CI/CD pipelines for frontend applications.",
    "entities": [
      [
        17,
        22,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Knowledge of Agile/Scrum methodologies and practices like TDD/BDD.",
    "entities": [
      [
        13,
        18,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Ability to work collaboratively in a fast-paced, Agile environment.",
    "entities": [
      [
        49,
        54,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Familiarity with CI/CD pipelines.",
    "entities": [
      [
        17,
        22,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Proficiency in Python and/or Java.",
    "entities": [
      [
        15,
        21,
        "SKILL"
      ],
      [
        29,
        33,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Database management systems such as MySQL, PostgreSQL, MongoDB, or Redis.",
    "entities": [
      [
        36,
        41,
        "SKILL"
      ],
      [
        43,
        53,
        "SKILL"
      ],
      [
        55,
        62,
        "SKILL"
      ],
      [
        67,
        72,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience with cloud services (AWS, Azure, or GCP) is a plus.",
    "entities": [
      [
        32,
        35,
        "SKILL"
      ],
      [
        37,
        42,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Familiarity with CI/CD tools, Docker, Kubernetes is an advantage.",
    "entities": [
      [
        17,
        22,
        "SKILL"
      ],
      [
        30,
        36,
        "SKILL"
      ],
      [
        38,
        48,
        "SKILL"
      ]
    ]
  },
  {
    "text": "[Preferred] Understanding Public Cloud (AWS, Azure, GCP, etc.) Terminology Work experience in the development of AI areas AWS / GCP / Azure Cloud SDK Programming",
    "entities": [
      [
        40,
        43,
        "SKILL"
      ],
      [
        45,
        50,
        "SKILL"
      ],
      [
        113,
        115,
        "SKILL"
      ],
      [
        122,
        125,
        "SKILL"
      ],
      [
        134,
        139,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Ưu tiên các ứng viên có các chứng chỉ: VMware Certified Associate (VCA), Microsoft Certified, Azure Administrator Associate.",
    "entities": [
      [
        96,
        101,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Cài đặt, cấu hình, tịch hợp, và vận hành các giải pháp ảo hóa (VMware) - Ngoại nữ: Tiếng Anh (yêu cầu kỹ năng đọc và hiểu liên quan đến chuyên môn, nghiệp vụ).",
    "entities": [
      [
        85,
        94,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Technical Skills: Knowledge with system monitoring tools (e.g., Grafana, AWS CloudWatch) and network infrastructure management.",
    "entities": [
      [
        64,
        71,
        "SKILL"
      ],
      [
        73,
        76,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Preferred (but not required) Cloud Experience: Knowledge with AWS, Azure, or Google Cloud services.",
    "entities": [
      [
        62,
        65,
        "SKILL"
      ],
      [
        67,
        72,
        "SKILL"
      ],
      [
        77,
        89,
        "SKILL"
      ]
    ]
  },
  {
    "text": "· Tốt nghiệp Đại học bằng khá trở lên chuyên ngành CNTT, ĐTVT, Toán tin Ứng dụng · Ít nhất 1 năm kinh nghiệm phát triển ứng dụng phần mềm bằng ngôn ngữ Java · Có kiến thức tốt về lập trình và thiết kế hướng đối tượng (OOP), Design Patterns · Có nền tảng cấu trúc dữ liệu và giải thuật tốt · Có kiến thức tốt về quy trình phát triển phần mềm · Thành thạo một trong các công nghệ: Webservices (SOAP/RESTful), Websocket, Hibernate, JPA, HTML5/CSS3, Spring MVC, Struts · Thành thạo một trong các hệ quản trị CSDL quan hệ: Oralce, MySQL, SQL Server · Có kỹ năng làm việc độc lập và làm việc theo nhóm tốt · Có kỹ năng giải quyết vấn đề tốt · Khả năng chịu áp lực cao · Năng động, sáng tạo, có khả năng tự nghiên cứu · Ưu tiên ứng viên có chứng chỉ quốc tế của Oracle về phát triển ứng dụng Java: Java SE, Java EE • Toeic 550 trở lên hoặc tương đương",
    "entities": [
      [
        152,
        156,
        "SKILL"
      ],
      [
        397,
        404,
        "SKILL"
      ],
      [
        526,
        531,
        "SKILL"
      ],
      [
        785,
        789,
        "SKILL"
      ],
      [
        791,
        795,
        "SKILL"
      ],
      [
        800,
        804,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Kiến thức về thống kê, phân tích khám phá dữ liệu (Exploratory Data Analysis - EDA) - Kiến thức về lập trình, cấu trúc dữ liệu & giải thuật, lý thuyết đồ thị - Kiến thức về xác suất thống kê, đại số tuyến tính, giải tích - Kỹ năng sử dụng thành thạo một trong các thư viện machine learning (scikit-learn, pyspark ML, TensorFlow, Keras) - Kiến thức về xử lý dữ liệu phân tán, xử lý dữ liệu lớn (Hadoop, Spark) - optional - Kỹ năng sử dụng ngôn ngữ lập trình: R, Python - Kỹ năng sử dụng ngôn ngữ SQL.",
    "entities": [
      [
        404,
        409,
        "SKILL"
      ],
      [
        463,
        469,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Sử dụng tin học văn phòng thành thạo Biết Tiếng Anh hoặc tiếng Hàn là một lợi thế.",
    "entities": [
      [
        42,
        51,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience with tools such as Postman, browser DevTools, Jira, DB and Git.",
    "entities": [
      [
        70,
        73,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Có ít nhất 3 năm kinh nghiệm Java, Spring.",
    "entities": [
      [
        31,
        35,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Đã sử dụng một trong các database: Oracle, MySQL, PostgresQL, MongoDB.",
    "entities": [
      [
        45,
        50,
        "SKILL"
      ],
      [
        52,
        62,
        "SKILL"
      ],
      [
        64,
        71,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Có kiến thức và kinh nghiệm xây dựng RESTful web services, web services, event-driven message.",
    "entities": [
      [
        39,
        46,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Sử dụng thành thạo một số công cụ: Git, Jira, ...",
    "entities": [
      [
        37,
        40,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Ưu tiên có kiến thức và kinh nghiệm công nghệ Kafka, Microservice là một lợi thế; - Ưu tiên có kiến thức và kinh nghiệm triển khai về K8s, docker là một lợi thế;",
    "entities": [
      [
        48,
        53,
        "SKILL"
      ],
      [
        55,
        67,
        "SKILL"
      ],
      [
        141,
        147,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Requirements - 3+ years of fullstack development experience - Proficient in TypeScript (Node.js+React) - Experience with Golang backend services - Basic understanding of Solana blockchain (e.g.,solana/web3.js)- Familiarity with Git, CI/CD, Docker Nice-to-Have - Exposure to message queues (e.g., Kafka, BullMQ) - Familiarity with blockchain patterns (DEX, liquidity, RPC) - Interest in DevOps (Kubernetes, AWS)",
    "entities": [
      [
        76,
        86,
        "SKILL"
      ],
      [
        88,
        95,
        "SKILL"
      ],
      [
        96,
        101,
        "SKILL"
      ],
      [
        121,
        127,
        "SKILL"
      ],
      [
        228,
        231,
        "SKILL"
      ],
      [
        233,
        238,
        "SKILL"
      ],
      [
        240,
        246,
        "SKILL"
      ],
      [
        296,
        301,
        "SKILL"
      ],
      [
        394,
        404,
        "SKILL"
      ],
      [
        406,
        409,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Trình độ Tiếng Anh: TOEIC 550 trở lên hoặc tương đương Kiến thức về lập trình, cấu trúc dữ liệu & giải thuật; Kỹ năng sử dụng ngôn ngữ lập trình Python, Java; Kiến thức về các loại CSDL (RDBMS, Graph Databases, NoSQL Products, ...); Kiến thức về học máy (Machine Learning), học sâu (Deep Learning); Kiến thức về xử lý ngôn ngữ tự nhiên (NLP), xử lý hình ảnh; Sử dụng thành thạo một trong các thư viện học máy: Scikit-learn, TensorFlow, Keras, PyTorch;",
    "entities": [
      [
        9,
        18,
        "SKILL"
      ],
      [
        145,
        151,
        "SKILL"
      ],
      [
        153,
        157,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Trình độ Tiếng Anh: TOEIC tối thiểu 550 Kiến thức về lập trình, cấu trúc dữ liệu & giải thuật Kiến thức về lập trình lưu trữ, xử lý dữ liệu phân tán, xử lý dữ liệu lớn (Hadoop, Spark, Elastic Search...",
    "entities": [
      [
        9,
        18,
        "SKILL"
      ],
      [
        177,
        182,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Kiến thức về xây dựng luồng xử lý dữ liệu (batch processing, stream procesing, ...) Kiển thức về các loại CSDL (RDBMS, Graph Databases, NoSQL Products, ...) Kỹ năng sử dụng ngôn ngữ lập trình (Java, Scala, ...), SQL K ỹ năng thành thạo một trong các framework, thư viện lưu trữ, xử lý dữ liệu lớn (Hadoop,Spark, Kafka, Zookeeper, ...) Kỹ năng sử dụng một trong các loại CSDL (Oracle, Neo4j, HBase, Cassandra, MongoDB, ..)",
    "entities": [
      [
        43,
        48,
        "SKILL"
      ],
      [
        193,
        197,
        "SKILL"
      ],
      [
        305,
        310,
        "SKILL"
      ],
      [
        312,
        317,
        "SKILL"
      ],
      [
        391,
        396,
        "SKILL"
      ],
      [
        409,
        416,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Yêu cầu chuyên môn - Tốt nghiệp đại học chuyên nghành: Công nghệ phần mềm, khoa học máy tính - Kinh nghiệm về Python 05 năm trở lên - Kinh nghiệm pt ứng dụng web, Rest API dựa trên Flask, FastAPI - Docker: + Biết cấu hình chạy ứng dụng.",
    "entities": [
      [
        110,
        116,
        "SKILL"
      ],
      [
        181,
        186,
        "SKILL"
      ],
      [
        188,
        195,
        "SKILL"
      ],
      [
        198,
        204,
        "SKILL"
      ]
    ]
  },
  {
    "text": "+ Hiểu biết về docker volume, docker port - Thành thạo hđh linux - Hiểu cơ chế hoạt động của website, các giao thức cơ bản HTTP, TCP - Đã từng sử dụng csdl: MySQL, SQL, Postgresql, MongoDB...",
    "entities": [
      [
        15,
        21,
        "SKILL"
      ],
      [
        30,
        36,
        "SKILL"
      ],
      [
        59,
        64,
        "SKILL"
      ],
      [
        157,
        162,
        "SKILL"
      ],
      [
        169,
        179,
        "SKILL"
      ],
      [
        181,
        188,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Biết các công cụ quản lý mã nguồn như Git - Khả năng làm việc độc lập và làm việc theo nhóm - Có kỹ năng giải quyết vấn đề và tư duy logic - Ưu tiên: + Có kinh nghiệm sử dụng Python trong môi trường Kubernetes, Cloud + Có kinh nghiệm về tối ưu hóa SQL, No-Sql + Có kinh nghiệm phát triển ứng dụng theo kiến trúc microservice",
    "entities": [
      [
        40,
        43,
        "SKILL"
      ],
      [
        177,
        183,
        "SKILL"
      ],
      [
        201,
        211,
        "SKILL"
      ],
      [
        314,
        326,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Technical Expertise /Chuyên Môn Kĩ Thuật Demonstrated experience working in cloud environments, with Azure as a minimum requirement.",
    "entities": [
      [
        101,
        106,
        "SKILL"
      ]
    ]
  },
  {
    "text": "/Có kinh nghiệm làm việc trong môi trường đám mây, tối thiểu với Azure.",
    "entities": [
      [
        65,
        70,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Familiarity with CI/CD tools and DevOps practices, including basic scripting and automation for deployments.",
    "entities": [
      [
        17,
        22,
        "SKILL"
      ]
    ]
  },
  {
    "text": "/Quen thuộc với công cụ CI/CD và thực hành DevOps, bao gồm scripting cơ bản và tự động hóa triển khai.",
    "entities": [
      [
        24,
        29,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Strong knowledge of operating systems: Windows, with working familiarity in Linux or Unix environments.",
    "entities": [
      [
        76,
        81,
        "SKILL"
      ]
    ]
  },
  {
    "text": "/Kiến thức vững về hệ điều hành Windows, và hiểu biết cơ bản về Linux hoặc Unix.",
    "entities": [
      [
        64,
        69,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Hands-on experience with virtualization (e.g., VMware) and containerization (e.g., Docker, Kubernetes).",
    "entities": [
      [
        83,
        89,
        "SKILL"
      ],
      [
        91,
        101,
        "SKILL"
      ]
    ]
  },
  {
    "text": "/Có kinh nghiệm thực hành với ảo hóa (VD: VMware) và container hóa (VD: Docker, Kubernetes).",
    "entities": [
      [
        72,
        78,
        "SKILL"
      ],
      [
        80,
        90,
        "SKILL"
      ]
    ]
  },
  {
    "text": "[Required] Have at least 3 years of experience (Prioritize high experience) Experienced web / mobile application development Can develop HTML, CSS, Javascript, jQuery Can develop based on Vue.js Experienced with collaboration tools like Git, Jira and Confluence Understand and use CI/CD TOEIC 450 or equivalent [Preferred] Understand Back-end Use Typescript Experienced with Node.js Experienced with javascript charts (Echarts, Chart.js, d3js, etc.) Experience using Tailwind, MUI OAuth development experience Korean communication Team management experience",
    "entities": [
      [
        137,
        141,
        "SKILL"
      ],
      [
        143,
        146,
        "SKILL"
      ],
      [
        148,
        158,
        "SKILL"
      ],
      [
        188,
        194,
        "SKILL"
      ],
      [
        237,
        240,
        "SKILL"
      ],
      [
        281,
        286,
        "SKILL"
      ],
      [
        347,
        357,
        "SKILL"
      ],
      [
        375,
        382,
        "SKILL"
      ],
      [
        400,
        410,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Yêu cầu: - Tốt nghiệp Đại học hệ chính quy một trong các chuyên ngành: CNTT, Toán Tin, Điện tử viễn thông - Có kinh nghiệm lập trình Java Springboot tối thiểu 3 năm; - Có kinh nghiệm làm việc và hiểu biết với API (Restful, SOAP), SCM (Git, SVN), IDE (Eclipse, IntelliJ, NetBeans); - Có kiến thức và kinh nghiệm lập trình Database Oracle/SQL; - Có kinh nghiệm lập trình về WebForm, MVC; - Nhiệt tình, ham học hỏi, mong muốn cầu tiến; - Có tư duy logic và lập trình; - Kỹ năng giao tiếp và truyền đạt tốt; - Kỹ năng làm việc hiệu quả trong nhóm cũng như độc lập.",
    "entities": [
      [
        133,
        137,
        "SKILL"
      ],
      [
        214,
        221,
        "SKILL"
      ],
      [
        235,
        238,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Ưu Tiên : - Ưu tiên: Có kinh nghiệm làm việc với Angular - Ứng viên đã có kinh nghiệm Banking và Fintech; - Ưu tiên Nhân sự hiểu biết và có kinh nghiệm về kiến trúc FrontEnd - BackEnd; - Ưu tiên Nhân sự sự hiểu biết và kinh nghiệm lập trình Microservice, Container; - Ưu tiên Nhân sự có kinh nghiệm về Message Queue hoặc tương tự; - Ưu tiên Nhân sự Redis hoặc tương tự;",
    "entities": [
      [
        241,
        253,
        "SKILL"
      ],
      [
        349,
        354,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Có khả năng phát triển HTML / CSS cơ bản.",
    "entities": [
      [
        25,
        29,
        "SKILL"
      ],
      [
        32,
        35,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Có khả năng code trực tiếp HTML, CSS không dùng Framework.",
    "entities": [
      [
        29,
        33,
        "SKILL"
      ],
      [
        35,
        38,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Có kỹ năng Javascript (jQuery).",
    "entities": [
      [
        13,
        23,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Có kiến thức về Framework (React, Vue.js, Angular).",
    "entities": [
      [
        29,
        34,
        "SKILL"
      ],
      [
        36,
        42,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Đã học cơ bản về PHP, MySQL, HTML, CSS, JavaScript,...",
    "entities": [
      [
        24,
        29,
        "SKILL"
      ],
      [
        31,
        35,
        "SKILL"
      ],
      [
        37,
        40,
        "SKILL"
      ],
      [
        42,
        52,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Tối thiểu 01 năm kinh nghiệm làm việc với Laravel hoặc Vue JS hoặc cả 2 trong môi trường product - Thành thạo Git hoặc các công cụ tương đương - Thành thạo ChatGPT hoặc các công cụ AI tương đương trong viết code - Ưu tiên có kinh nghiệm với các công cụ sau: Vue JS, NodeJS, BootsTrap, JSON, XML, Xampp, My SQL, MariaDB, MongoDB,...",
    "entities": [
      [
        112,
        115,
        "SKILL"
      ],
      [
        183,
        185,
        "SKILL"
      ],
      [
        268,
        274,
        "SKILL"
      ],
      [
        313,
        320,
        "SKILL"
      ],
      [
        322,
        329,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Ưu tiên hiểu biết về Docker, Kubernetes, CI/CD pipelines - Ưu tiên có sản phẩm web tự làm bằng PHP để demo là lợi thế.",
    "entities": [
      [
        23,
        29,
        "SKILL"
      ],
      [
        31,
        41,
        "SKILL"
      ],
      [
        43,
        48,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Có khả năng làm việc tốt trong môi trường Teamwork cũng như làm việc độc lập, có kinh nghiệm làm việc trong các dự án theo mô hình Agile/Scrum là lợi thế.",
    "entities": [
      [
        133,
        138,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Bắt buộc Có từ 2 năm kinh nghiệm làm việc thực tế trong lĩnh vực kiểm thử phần mềm Có khả năng đọc hiểu tài liệu Tiếng Anh cơ bản.",
    "entities": [
      [
        113,
        122,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Đã có kinh nghiệm với Automation test (vui lòng ghi rõ số năm kinh nghiệm Automation test trong CV) Ưu tiên Tiếng Anh giao tiếp tốt là một lợi thế (vui lòng ghi rõ khả năng ngoại ngữ trong CV).",
    "entities": [
      [
        108,
        117,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Các yêu cầu khác: • Sử dụng tốt Tiếng Anh.",
    "entities": [
      [
        34,
        43,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Microsoft Excel, Word, Power Point, Agile, Scrum.",
    "entities": [
      [
        36,
        41,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Thành thạo Tiếng Anh, bao gồm cả kỹ năng viết và nói.",
    "entities": [
      [
        11,
        20,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có ít nhất 3 năm kinh nghiệm làm việc với Javascript/Typescript hoặc Python.",
    "entities": [
      [
        42,
        52,
        "SKILL"
      ],
      [
        53,
        63,
        "SKILL"
      ],
      [
        69,
        75,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Hiểu biết sâu về tích hợp API, GraphQL, WebSocket và cách ứng dụng nó trong các ứng dụng real time.",
    "entities": [
      [
        31,
        38,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Thành thạo cấu trúc dữ liệu và cơ sở dữ liệu: MySQL/MongoDB/PostgreSQL.",
    "entities": [
      [
        46,
        51,
        "SKILL"
      ],
      [
        52,
        59,
        "SKILL"
      ],
      [
        60,
        70,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Ưu tiên ứng viên có kiến thức về Microservices, Docker, K8s, DevOps, GitOps.",
    "entities": [
      [
        48,
        54,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Ưu tiên ứng viên kinh nghiệm với Java, PHP, đặc biệt là trong các dự án tích hợp đa nền tảng.",
    "entities": [
      [
        35,
        39,
        "SKILL"
      ]
    ]
  },
  {
    "text": "- Biết sử dụng công cụ quản lý phiên bản mã nguồn như Git, SVN.",
    "entities": [
      [
        54,
        57,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Có kinh nghiệm làm việc với các hệ thống như Microsoft Fabric, Azure Synapse Analytics, Databricks.",
    "entities": [
      [
        63,
        68,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Thành thạo lập trình với ít nhất một ngôn ngữ như Java, Python hoặc .NET.",
    "entities": [
      [
        50,
        54,
        "SKILL"
      ],
      [
        56,
        62,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Tiếng Anh đọc hiểu cơ bản (phần mềm và tài liệu hướng dẫn bằng Tiếng Anh) Có khả năng làm việc độc lập hoặc theo nhóm.",
    "entities": [
      [
        0,
        9,
        "SKILL"
      ],
      [
        63,
        72,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience with RESTful API development and integration.",
    "entities": [
      [
        16,
        23,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Familiarity with Agile/Scrum development methodologies.",
    "entities": [
      [
        17,
        22,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Knowledge of cloud services (Azure, AWS, GCP).",
    "entities": [
      [
        29,
        34,
        "SKILL"
      ],
      [
        36,
        39,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Familiarity with CI/CD pipelines and DevOps practices.",
    "entities": [
      [
        17,
        22,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience in containerization technologies like Docker, Kubernetes.",
    "entities": [
      [
        49,
        55,
        "SKILL"
      ],
      [
        57,
        67,
        "SKILL"
      ]
    ]
  },
  {
    "text": "[Required] Graduated from University major in information technology or related At least one year of experience in same position Experience with Git, Jira, and Confluence.",
    "entities": [
      [
        145,
        148,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Understanding and utilization of CI/CD.",
    "entities": [
      [
        33,
        38,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience in Python programming.",
    "entities": [
      [
        14,
        20,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Familiarity with Spring Boot and Java code.",
    "entities": [
      [
        17,
        28,
        "SKILL"
      ],
      [
        33,
        37,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience working with Amazon SQS and AWS Lambda.",
    "entities": [
      [
        39,
        42,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Proficiency in Spring Boot and Java design/development.",
    "entities": [
      [
        15,
        26,
        "SKILL"
      ],
      [
        31,
        35,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Strong knowledge of DB/SQL and Python ORM.",
    "entities": [
      [
        31,
        37,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience in Terraform design and development.",
    "entities": [
      [
        14,
        23,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Familiarity with AWS services: Lambda, SQS, EventBridge, SES.",
    "entities": [
      [
        17,
        20,
        "SKILL"
      ]
    ]
  },
  {
    "text": "[Preferred] Experience in Agile and application lifecycle management.",
    "entities": [
      [
        26,
        31,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience with CI/CD and Git applications.",
    "entities": [
      [
        16,
        21,
        "SKILL"
      ],
      [
        26,
        29,
        "SKILL"
      ]
    ]
  },
  {
    "text": "Experience in design and development using Amazon SQS/AWS Lambda.",
    "entities": [
      [
        54,
        57,
        "SKILL"
      ]
    ]
  }
]